RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * ENET_PALR - Physical Address Lower Register
 ******************************************************************************/

/*!
 * @brief ENET_PALR - Physical Address Lower Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * PALR contains the lower 32 bits (bytes 0, 1, 2, 3) of the 48-bit address used
 * in the address recognition process to compare with the destination address
 * (DA) field of receive frames with an individual DA. In addition, this register
 * is used in bytes 0 through 3 of the six-byte source address field when
 * transmitting PAUSE frames. This register is not reset and you must initialize it.
 */
/*!
 * @name Constants and macros for entire ENET_PALR register
 */
/*@{*/
#define ENET_RD_PALR(base)       (ENET_PALR_REG(base))
#define ENET_WR_PALR(base, value) (ENET_PALR_REG(base) = (value))
#define ENET_RMW_PALR(base, mask, value) (ENET_WR_PALR(base, (ENET_RD_PALR(base) & ~(mask)) | (value)))
#define ENET_SET_PALR(base, value) (ENET_WR_PALR(base, ENET_RD_PALR(base) |  (value)))
#define ENET_CLR_PALR(base, value) (ENET_WR_PALR(base, ENET_RD_PALR(base) & ~(value)))
#define ENET_TOG_PALR(base, value) (ENET_WR_PALR(base, ENET_RD_PALR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_PAUR - Physical Address Upper Register
 ******************************************************************************/

/*!
 * @brief ENET_PAUR - Physical Address Upper Register (RW)
 *
 * Reset value: 0x00008808U
 *
 * PAUR contains the upper 16 bits (bytes 4 and 5) of the 48-bit address used in
 * the address recognition process to compare with the destination address (DA)
 * field of receive frames with an individual DA. In addition, this register is
 * used in bytes 4 and 5 of the six-byte source address field when transmitting
 * PAUSE frames. Bits 15:0 of PAUR contain a constant type field (0x8808) for
 * transmission of PAUSE frames. The upper 16 bits of this register are not reset and
 * you must initialize it.
 */
/*!
 * @name Constants and macros for entire ENET_PAUR register
 */
/*@{*/
#define ENET_RD_PAUR(base)       (ENET_PAUR_REG(base))
#define ENET_WR_PAUR(base, value) (ENET_PAUR_REG(base) = (value))
#define ENET_RMW_PAUR(base, mask, value) (ENET_WR_PAUR(base, (ENET_RD_PAUR(base) & ~(mask)) | (value)))
#define ENET_SET_PAUR(base, value) (ENET_WR_PAUR(base, ENET_RD_PAUR(base) |  (value)))
#define ENET_CLR_PAUR(base, value) (ENET_WR_PAUR(base, ENET_RD_PAUR(base) & ~(value)))
#define ENET_TOG_PAUR(base, value) (ENET_WR_PAUR(base, ENET_RD_PAUR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_PAUR bitfields
 */

/*!
 * @name Register ENET_PAUR, field TYPE[15:0] (RO)
 *
 * These fields have a constant value of 0x8808.
 */
/*@{*/
/*! @brief Read current value of the ENET_PAUR_TYPE field. */
#define ENET_RD_PAUR_TYPE(base) ((ENET_PAUR_REG(base) & ENET_PAUR_TYPE_MASK) >> ENET_PAUR_TYPE_SHIFT)
#define ENET_BRD_PAUR_TYPE(base) (ENET_RD_PAUR_TYPE(base))
/*@}*/

/*!
 * @name Register ENET_PAUR, field PADDR2[31:16] (RW)
 *
 * Bytes 4 (bits 31:24) and 5 (bits 23:16) of the 6-byte individual address used
 * for exact match, and the source address field in PAUSE frames.
 */
/*@{*/
/*! @brief Read current value of the ENET_PAUR_PADDR2 field. */
#define ENET_RD_PAUR_PADDR2(base) ((ENET_PAUR_REG(base) & ENET_PAUR_PADDR2_MASK) >> ENET_PAUR_PADDR2_SHIFT)
#define ENET_BRD_PAUR_PADDR2(base) (ENET_RD_PAUR_PADDR2(base))

/*! @brief Set the PADDR2 field to a new value. */
#define ENET_WR_PAUR_PADDR2(base, value) (ENET_RMW_PAUR(base, ENET_PAUR_PADDR2_MASK, ENET_PAUR_PADDR2(value)))
#define ENET_BWR_PAUR_PADDR2(base, value) (ENET_WR_PAUR_PADDR2(base, value))
/*@}*/

/*******************************************************************************
 * ENET_OPD - Opcode/Pause Duration Register
 ******************************************************************************/

/*!
 * @brief ENET_OPD - Opcode/Pause Duration Register (RW)
 *
 * Reset value: 0x00010000U
 *
 * OPD is read/write accessible. This register contains the 16-bit opcode and
 * 16-bit pause duration fields used in transmission of a PAUSE frame. The opcode
 * field is a constant value, 0x0001. When another node detects a PAUSE frame,
 * that node pauses transmission for the duration specified in the pause duration
 * field. The lower 16 bits of this register are not reset and you must initialize
 * it.
 */
/*!
 * @name Constants and macros for entire ENET_OPD register
 */
/*@{*/
#define ENET_RD_OPD(base)        (ENET_OPD_REG(base))
#define ENET_WR_OPD(base, value) (ENET_OPD_REG(base) = (value))
#define ENET_RMW_OPD(base, mask, value) (ENET_WR_OPD(base, (ENET_RD_OPD(base) & ~(mask)) | (value)))
#define ENET_SET_OPD(base, value) (ENET_WR_OPD(base, ENET_RD_OPD(base) |  (value)))
#define ENET_CLR_OPD(base, value) (ENET_WR_OPD(base, ENET_RD_OPD(base) & ~(value)))
#define ENET_TOG_OPD(base, value) (ENET_WR_OPD(base, ENET_RD_OPD(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_OPD bitfields
 */

/*!
 * @name Register ENET_OPD, field PAUSE_DUR[15:0] (RW)
 *
 * Pause duration field used in PAUSE frames.
 */
/*@{*/
/*! @brief Read current value of the ENET_OPD_PAUSE_DUR field. */
#define ENET_RD_OPD_PAUSE_DUR(base) ((ENET_OPD_REG(base) & ENET_OPD_PAUSE_DUR_MASK) >> ENET_OPD_PAUSE_DUR_SHIFT)
#define ENET_BRD_OPD_PAUSE_DUR(base) (ENET_RD_OPD_PAUSE_DUR(base))

/*! @brief Set the PAUSE_DUR field to a new value. */
#define ENET_WR_OPD_PAUSE_DUR(base, value) (ENET_RMW_OPD(base, ENET_OPD_PAUSE_DUR_MASK, ENET_OPD_PAUSE_DUR(value)))
#define ENET_BWR_OPD_PAUSE_DUR(base, value) (ENET_WR_OPD_PAUSE_DUR(base, value))
/*@}*/

/*!
 * @name Register ENET_OPD, field OPCODE[31:16] (RO)
 *
 * These fields have a constant value of 0x0001.
 */
/*@{*/
/*! @brief Read current value of the ENET_OPD_OPCODE field. */
#define ENET_RD_OPD_OPCODE(base) ((ENET_OPD_REG(base) & ENET_OPD_OPCODE_MASK) >> ENET_OPD_OPCODE_SHIFT)
#define ENET_BRD_OPD_OPCODE(base) (ENET_RD_OPD_OPCODE(base))
/*@}*/

