RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*
 * Constants & macros for individual ENET_TFWR bitfields
 */

/*!
 * @name Register ENET_TFWR, field TFWR[5:0] (RW)
 *
 * If STRFWD is cleared, indicates the number of bytes written to the transmit
 * FIFO before transmission of a frame begins. If a frame with less than the
 * threshold is written,it is still sent, independently of this threshold setting. The
 * threshold is only relevant if the frame is larger than the threshold given.
 *
 * Values:
 * - 0b000000 - 64 bytes written.
 * - 0b000001 - 64 bytes written.
 * - 0b000010 - 128 bytes written.
 * - 0b000011 - 192 bytes written.
 * - 0b111111 - 4032 bytes written.
 */
/*@{*/
/*! @brief Read current value of the ENET_TFWR_TFWR field. */
#define ENET_RD_TFWR_TFWR(base) ((ENET_TFWR_REG(base) & ENET_TFWR_TFWR_MASK) >> ENET_TFWR_TFWR_SHIFT)
#define ENET_BRD_TFWR_TFWR(base) (ENET_RD_TFWR_TFWR(base))

/*! @brief Set the TFWR field to a new value. */
#define ENET_WR_TFWR_TFWR(base, value) (ENET_RMW_TFWR(base, ENET_TFWR_TFWR_MASK, ENET_TFWR_TFWR(value)))
#define ENET_BWR_TFWR_TFWR(base, value) (ENET_WR_TFWR_TFWR(base, value))
/*@}*/

/*!
 * @name Register ENET_TFWR, field STRFWD[8] (RW)
 *
 * Values:
 * - 0b0 - Disabled, the transmission start threshold is programmed in TFWR.
 * - 0b1 - Enabled.
 */
/*@{*/
/*! @brief Read current value of the ENET_TFWR_STRFWD field. */
#define ENET_RD_TFWR_STRFWD(base) ((ENET_TFWR_REG(base) & ENET_TFWR_STRFWD_MASK) >> ENET_TFWR_STRFWD_SHIFT)
#define ENET_BRD_TFWR_STRFWD(base) (BITBAND_ACCESS32(&ENET_TFWR_REG(base), ENET_TFWR_STRFWD_SHIFT))

/*! @brief Set the STRFWD field to a new value. */
#define ENET_WR_TFWR_STRFWD(base, value) (ENET_RMW_TFWR(base, ENET_TFWR_STRFWD_MASK, ENET_TFWR_STRFWD(value)))
#define ENET_BWR_TFWR_STRFWD(base, value) (BITBAND_ACCESS32(&ENET_TFWR_REG(base), ENET_TFWR_STRFWD_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_RDSR - Receive Descriptor Ring Start Register
 ******************************************************************************/

/*!
 * @brief ENET_RDSR - Receive Descriptor Ring Start Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * RDSR points to the beginning of the circular receive buffer descriptor queue
 * in external memory. This pointer must be 64-bit aligned (bits 2-0 must be
 * zero); however, it is recommended to be 128-bit aligned, that is, evenly divisible
 * by 16. This register is not reset and must be initialized prior to operation.
 */
/*!
 * @name Constants and macros for entire ENET_RDSR register
 */
/*@{*/
#define ENET_RD_RDSR(base)       (ENET_RDSR_REG(base))
#define ENET_WR_RDSR(base, value) (ENET_RDSR_REG(base) = (value))
#define ENET_RMW_RDSR(base, mask, value) (ENET_WR_RDSR(base, (ENET_RD_RDSR(base) & ~(mask)) | (value)))
#define ENET_SET_RDSR(base, value) (ENET_WR_RDSR(base, ENET_RD_RDSR(base) |  (value)))
#define ENET_CLR_RDSR(base, value) (ENET_WR_RDSR(base, ENET_RD_RDSR(base) & ~(value)))
#define ENET_TOG_RDSR(base, value) (ENET_WR_RDSR(base, ENET_RD_RDSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RDSR bitfields
 */

/*!
 * @name Register ENET_RDSR, field R_DES_START[31:3] (RW)
 *
 * Pointer to the beginning of the receive buffer descriptor queue.
 */
/*@{*/
/*! @brief Read current value of the ENET_RDSR_R_DES_START field. */
#define ENET_RD_RDSR_R_DES_START(base) ((ENET_RDSR_REG(base) & ENET_RDSR_R_DES_START_MASK) >> ENET_RDSR_R_DES_START_SHIFT)
#define ENET_BRD_RDSR_R_DES_START(base) (ENET_RD_RDSR_R_DES_START(base))

/*! @brief Set the R_DES_START field to a new value. */
#define ENET_WR_RDSR_R_DES_START(base, value) (ENET_RMW_RDSR(base, ENET_RDSR_R_DES_START_MASK, ENET_RDSR_R_DES_START(value)))
#define ENET_BWR_RDSR_R_DES_START(base, value) (ENET_WR_RDSR_R_DES_START(base, value))
/*@}*/

/*******************************************************************************
 * ENET_TDSR - Transmit Buffer Descriptor Ring Start Register
 ******************************************************************************/

/*!
 * @brief ENET_TDSR - Transmit Buffer Descriptor Ring Start Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TDSR provides a pointer to the beginning of the circular transmit buffer
 * descriptor queue in external memory. This pointer must be 64-bit aligned (bits 2-0
 * must be zero); however, it is recommended to be 128-bit aligned, that is,
 * evenly divisible by 16. This register is undefined at reset and must be
 * initialized prior to operation.
 */
/*!
 * @name Constants and macros for entire ENET_TDSR register
 */
/*@{*/
#define ENET_RD_TDSR(base)       (ENET_TDSR_REG(base))
#define ENET_WR_TDSR(base, value) (ENET_TDSR_REG(base) = (value))
#define ENET_RMW_TDSR(base, mask, value) (ENET_WR_TDSR(base, (ENET_RD_TDSR(base) & ~(mask)) | (value)))
#define ENET_SET_TDSR(base, value) (ENET_WR_TDSR(base, ENET_RD_TDSR(base) |  (value)))
#define ENET_CLR_TDSR(base, value) (ENET_WR_TDSR(base, ENET_RD_TDSR(base) & ~(value)))
#define ENET_TOG_TDSR(base, value) (ENET_WR_TDSR(base, ENET_RD_TDSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TDSR bitfields
 */

/*!
 * @name Register ENET_TDSR, field X_DES_START[31:3] (RW)
 *
 * Pointer to the beginning of the transmit buffer descriptor queue.
 */
/*@{*/
/*! @brief Read current value of the ENET_TDSR_X_DES_START field. */
#define ENET_RD_TDSR_X_DES_START(base) ((ENET_TDSR_REG(base) & ENET_TDSR_X_DES_START_MASK) >> ENET_TDSR_X_DES_START_SHIFT)
#define ENET_BRD_TDSR_X_DES_START(base) (ENET_RD_TDSR_X_DES_START(base))

/*! @brief Set the X_DES_START field to a new value. */
#define ENET_WR_TDSR_X_DES_START(base, value) (ENET_RMW_TDSR(base, ENET_TDSR_X_DES_START_MASK, ENET_TDSR_X_DES_START(value)))
#define ENET_BWR_TDSR_X_DES_START(base, value) (ENET_WR_TDSR_X_DES_START(base, value))
/*@}*/

/*******************************************************************************
 * ENET_MRBR - Maximum Receive Buffer Size Register
 ******************************************************************************/

/*!
 * @brief ENET_MRBR - Maximum Receive Buffer Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MRBR is a user-programmable register that dictates the maximum size of
 * all receive buffers. This value should take into consideration that the receive
 * CRC is always written into the last receive buffer. To allow one maximum size
 * frame per buffer, MRBR must be set to RCR[MAX_FL] or larger. To properly align
 * the buffer, MRBR must be evenly divisible by 16. To ensure this, bits 3-0 are
 * set to zero by the device. To minimize bus usage (descriptor fetches), set
 * MRBR greater than or equal to 256 bytes. The MRBR register is undefined at reset
 * and must be initialized by the user.
 */
/*!
 * @name Constants and macros for entire ENET_MRBR register
 */
/*@{*/
#define ENET_RD_MRBR(base)       (ENET_MRBR_REG(base))
#define ENET_WR_MRBR(base, value) (ENET_MRBR_REG(base) = (value))
#define ENET_RMW_MRBR(base, mask, value) (ENET_WR_MRBR(base, (ENET_RD_MRBR(base) & ~(mask)) | (value)))
#define ENET_SET_MRBR(base, value) (ENET_WR_MRBR(base, ENET_RD_MRBR(base) |  (value)))
#define ENET_CLR_MRBR(base, value) (ENET_WR_MRBR(base, ENET_RD_MRBR(base) & ~(value)))
#define ENET_TOG_MRBR(base, value) (ENET_WR_MRBR(base, ENET_RD_MRBR(base) ^  (value)))
/*@}*/

