RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * ENET_RMON_T_COL - RMON Tx collision count (RMON_T_COL)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_COL - RMON Tx collision count (RMON_T_COL) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_COL register
 */
/*@{*/
#define ENET_RD_RMON_T_COL(base) (ENET_RMON_T_COL_REG(base))
#define ENET_WR_RMON_T_COL(base, value) (ENET_RMON_T_COL_REG(base) = (value))
#define ENET_RMW_RMON_T_COL(base, mask, value) (ENET_WR_RMON_T_COL(base, (ENET_RD_RMON_T_COL(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_COL(base, value) (ENET_WR_RMON_T_COL(base, ENET_RD_RMON_T_COL(base) |  (value)))
#define ENET_CLR_RMON_T_COL(base, value) (ENET_WR_RMON_T_COL(base, ENET_RD_RMON_T_COL(base) & ~(value)))
#define ENET_TOG_RMON_T_COL(base, value) (ENET_WR_RMON_T_COL(base, ENET_RD_RMON_T_COL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_COL bitfields
 */

/*!
 * @name Register ENET_RMON_T_COL, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_COL_TXPKTS field. */
#define ENET_RD_RMON_T_COL_TXPKTS(base) ((ENET_RMON_T_COL_REG(base) & ENET_RMON_T_COL_TXPKTS_MASK) >> ENET_RMON_T_COL_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_COL_TXPKTS(base) (ENET_RD_RMON_T_COL_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_P64 - RMON Tx 64 byte packets (RMON_T_P64)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_P64 - RMON Tx 64 byte packets (RMON_T_P64) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_P64 register
 */
/*@{*/
#define ENET_RD_RMON_T_P64(base) (ENET_RMON_T_P64_REG(base))
#define ENET_WR_RMON_T_P64(base, value) (ENET_RMON_T_P64_REG(base) = (value))
#define ENET_RMW_RMON_T_P64(base, mask, value) (ENET_WR_RMON_T_P64(base, (ENET_RD_RMON_T_P64(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_P64(base, value) (ENET_WR_RMON_T_P64(base, ENET_RD_RMON_T_P64(base) |  (value)))
#define ENET_CLR_RMON_T_P64(base, value) (ENET_WR_RMON_T_P64(base, ENET_RD_RMON_T_P64(base) & ~(value)))
#define ENET_TOG_RMON_T_P64(base, value) (ENET_WR_RMON_T_P64(base, ENET_RD_RMON_T_P64(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P64 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P64, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_P64_TXPKTS field. */
#define ENET_RD_RMON_T_P64_TXPKTS(base) ((ENET_RMON_T_P64_REG(base) & ENET_RMON_T_P64_TXPKTS_MASK) >> ENET_RMON_T_P64_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_P64_TXPKTS(base) (ENET_RD_RMON_T_P64_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_P65TO127 - RMON Tx 65 to 127 byte packets (RMON_T_P65TO127)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_P65TO127 - RMON Tx 65 to 127 byte packets (RMON_T_P65TO127) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_P65TO127 register
 */
/*@{*/
#define ENET_RD_RMON_T_P65TO127(base) (ENET_RMON_T_P65TO127_REG(base))
#define ENET_WR_RMON_T_P65TO127(base, value) (ENET_RMON_T_P65TO127_REG(base) = (value))
#define ENET_RMW_RMON_T_P65TO127(base, mask, value) (ENET_WR_RMON_T_P65TO127(base, (ENET_RD_RMON_T_P65TO127(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_P65TO127(base, value) (ENET_WR_RMON_T_P65TO127(base, ENET_RD_RMON_T_P65TO127(base) |  (value)))
#define ENET_CLR_RMON_T_P65TO127(base, value) (ENET_WR_RMON_T_P65TO127(base, ENET_RD_RMON_T_P65TO127(base) & ~(value)))
#define ENET_TOG_RMON_T_P65TO127(base, value) (ENET_WR_RMON_T_P65TO127(base, ENET_RD_RMON_T_P65TO127(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P65TO127 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P65TO127, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_P65TO127_TXPKTS field. */
#define ENET_RD_RMON_T_P65TO127_TXPKTS(base) ((ENET_RMON_T_P65TO127_REG(base) & ENET_RMON_T_P65TO127_TXPKTS_MASK) >> ENET_RMON_T_P65TO127_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_P65TO127_TXPKTS(base) (ENET_RD_RMON_T_P65TO127_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_P128TO255 - RMON Tx 128 to 255 byte packets (RMON_T_P128TO255)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_P128TO255 - RMON Tx 128 to 255 byte packets (RMON_T_P128TO255) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_P128TO255 register
 */
/*@{*/
#define ENET_RD_RMON_T_P128TO255(base) (ENET_RMON_T_P128TO255_REG(base))
#define ENET_WR_RMON_T_P128TO255(base, value) (ENET_RMON_T_P128TO255_REG(base) = (value))
#define ENET_RMW_RMON_T_P128TO255(base, mask, value) (ENET_WR_RMON_T_P128TO255(base, (ENET_RD_RMON_T_P128TO255(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_P128TO255(base, value) (ENET_WR_RMON_T_P128TO255(base, ENET_RD_RMON_T_P128TO255(base) |  (value)))
#define ENET_CLR_RMON_T_P128TO255(base, value) (ENET_WR_RMON_T_P128TO255(base, ENET_RD_RMON_T_P128TO255(base) & ~(value)))
#define ENET_TOG_RMON_T_P128TO255(base, value) (ENET_WR_RMON_T_P128TO255(base, ENET_RD_RMON_T_P128TO255(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P128TO255 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P128TO255, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_P128TO255_TXPKTS field. */
#define ENET_RD_RMON_T_P128TO255_TXPKTS(base) ((ENET_RMON_T_P128TO255_REG(base) & ENET_RMON_T_P128TO255_TXPKTS_MASK) >> ENET_RMON_T_P128TO255_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_P128TO255_TXPKTS(base) (ENET_RD_RMON_T_P128TO255_TXPKTS(base))
/*@}*/

