RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * ENET_RMON_T_P256TO511 - RMON Tx 256 to 511 byte packets (RMON_T_P256TO511)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_P256TO511 - RMON Tx 256 to 511 byte packets (RMON_T_P256TO511) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_P256TO511 register
 */
/*@{*/
#define ENET_RD_RMON_T_P256TO511(base) (ENET_RMON_T_P256TO511_REG(base))
#define ENET_WR_RMON_T_P256TO511(base, value) (ENET_RMON_T_P256TO511_REG(base) = (value))
#define ENET_RMW_RMON_T_P256TO511(base, mask, value) (ENET_WR_RMON_T_P256TO511(base, (ENET_RD_RMON_T_P256TO511(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_P256TO511(base, value) (ENET_WR_RMON_T_P256TO511(base, ENET_RD_RMON_T_P256TO511(base) |  (value)))
#define ENET_CLR_RMON_T_P256TO511(base, value) (ENET_WR_RMON_T_P256TO511(base, ENET_RD_RMON_T_P256TO511(base) & ~(value)))
#define ENET_TOG_RMON_T_P256TO511(base, value) (ENET_WR_RMON_T_P256TO511(base, ENET_RD_RMON_T_P256TO511(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P256TO511 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P256TO511, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_P256TO511_TXPKTS field. */
#define ENET_RD_RMON_T_P256TO511_TXPKTS(base) ((ENET_RMON_T_P256TO511_REG(base) & ENET_RMON_T_P256TO511_TXPKTS_MASK) >> ENET_RMON_T_P256TO511_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_P256TO511_TXPKTS(base) (ENET_RD_RMON_T_P256TO511_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_P512TO1023 - RMON Tx 512 to 1023 byte packets (RMON_T_P512TO1023)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_P512TO1023 - RMON Tx 512 to 1023 byte packets (RMON_T_P512TO1023) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_P512TO1023 register
 */
/*@{*/
#define ENET_RD_RMON_T_P512TO1023(base) (ENET_RMON_T_P512TO1023_REG(base))
#define ENET_WR_RMON_T_P512TO1023(base, value) (ENET_RMON_T_P512TO1023_REG(base) = (value))
#define ENET_RMW_RMON_T_P512TO1023(base, mask, value) (ENET_WR_RMON_T_P512TO1023(base, (ENET_RD_RMON_T_P512TO1023(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_P512TO1023(base, value) (ENET_WR_RMON_T_P512TO1023(base, ENET_RD_RMON_T_P512TO1023(base) |  (value)))
#define ENET_CLR_RMON_T_P512TO1023(base, value) (ENET_WR_RMON_T_P512TO1023(base, ENET_RD_RMON_T_P512TO1023(base) & ~(value)))
#define ENET_TOG_RMON_T_P512TO1023(base, value) (ENET_WR_RMON_T_P512TO1023(base, ENET_RD_RMON_T_P512TO1023(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P512TO1023 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P512TO1023, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_P512TO1023_TXPKTS field. */
#define ENET_RD_RMON_T_P512TO1023_TXPKTS(base) ((ENET_RMON_T_P512TO1023_REG(base) & ENET_RMON_T_P512TO1023_TXPKTS_MASK) >> ENET_RMON_T_P512TO1023_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_P512TO1023_TXPKTS(base) (ENET_RD_RMON_T_P512TO1023_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_P1024TO2047 - RMON Tx 1024 to 2047 byte packets (RMON_T_P1024TO2047)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_P1024TO2047 - RMON Tx 1024 to 2047 byte packets (RMON_T_P1024TO2047) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_P1024TO2047 register
 */
/*@{*/
#define ENET_RD_RMON_T_P1024TO2047(base) (ENET_RMON_T_P1024TO2047_REG(base))
#define ENET_WR_RMON_T_P1024TO2047(base, value) (ENET_RMON_T_P1024TO2047_REG(base) = (value))
#define ENET_RMW_RMON_T_P1024TO2047(base, mask, value) (ENET_WR_RMON_T_P1024TO2047(base, (ENET_RD_RMON_T_P1024TO2047(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_P1024TO2047(base, value) (ENET_WR_RMON_T_P1024TO2047(base, ENET_RD_RMON_T_P1024TO2047(base) |  (value)))
#define ENET_CLR_RMON_T_P1024TO2047(base, value) (ENET_WR_RMON_T_P1024TO2047(base, ENET_RD_RMON_T_P1024TO2047(base) & ~(value)))
#define ENET_TOG_RMON_T_P1024TO2047(base, value) (ENET_WR_RMON_T_P1024TO2047(base, ENET_RD_RMON_T_P1024TO2047(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P1024TO2047 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P1024TO2047, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_P1024TO2047_TXPKTS field. */
#define ENET_RD_RMON_T_P1024TO2047_TXPKTS(base) ((ENET_RMON_T_P1024TO2047_REG(base) & ENET_RMON_T_P1024TO2047_TXPKTS_MASK) >> ENET_RMON_T_P1024TO2047_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_P1024TO2047_TXPKTS(base) (ENET_RD_RMON_T_P1024TO2047_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_P_GTE2048 - RMON Tx packets w > 2048 bytes (RMON_T_P_GTE2048)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_P_GTE2048 - RMON Tx packets w > 2048 bytes (RMON_T_P_GTE2048) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_P_GTE2048 register
 */
/*@{*/
#define ENET_RD_RMON_T_P_GTE2048(base) (ENET_RMON_T_P_GTE2048_REG(base))
#define ENET_WR_RMON_T_P_GTE2048(base, value) (ENET_RMON_T_P_GTE2048_REG(base) = (value))
#define ENET_RMW_RMON_T_P_GTE2048(base, mask, value) (ENET_WR_RMON_T_P_GTE2048(base, (ENET_RD_RMON_T_P_GTE2048(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_P_GTE2048(base, value) (ENET_WR_RMON_T_P_GTE2048(base, ENET_RD_RMON_T_P_GTE2048(base) |  (value)))
#define ENET_CLR_RMON_T_P_GTE2048(base, value) (ENET_WR_RMON_T_P_GTE2048(base, ENET_RD_RMON_T_P_GTE2048(base) & ~(value)))
#define ENET_TOG_RMON_T_P_GTE2048(base, value) (ENET_WR_RMON_T_P_GTE2048(base, ENET_RD_RMON_T_P_GTE2048(base) ^  (value)))
/*@}*/

