RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*
 * Constants & macros for individual ENET_RMON_T_P_GTE2048 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P_GTE2048, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_P_GTE2048_TXPKTS field. */
#define ENET_RD_RMON_T_P_GTE2048_TXPKTS(base) ((ENET_RMON_T_P_GTE2048_REG(base) & ENET_RMON_T_P_GTE2048_TXPKTS_MASK) >> ENET_RMON_T_P_GTE2048_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_P_GTE2048_TXPKTS(base) (ENET_RD_RMON_T_P_GTE2048_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_OCTETS - RMON Tx Octets (RMON_T_OCTETS)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_OCTETS - RMON Tx Octets (RMON_T_OCTETS) (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_OCTETS register
 */
/*@{*/
#define ENET_RD_RMON_T_OCTETS(base) (ENET_RMON_T_OCTETS_REG(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_DROP - Count of frames not counted correctly (IEEE_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable.
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_DROP - Count of frames not counted correctly (IEEE_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable. (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_DROP register
 */
/*@{*/
#define ENET_RD_IEEE_T_DROP(base) (ENET_IEEE_T_DROP_REG(base))
#define ENET_WR_IEEE_T_DROP(base, value) (ENET_IEEE_T_DROP_REG(base) = (value))
#define ENET_RMW_IEEE_T_DROP(base, mask, value) (ENET_WR_IEEE_T_DROP(base, (ENET_RD_IEEE_T_DROP(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_DROP(base, value) (ENET_WR_IEEE_T_DROP(base, ENET_RD_IEEE_T_DROP(base) |  (value)))
#define ENET_CLR_IEEE_T_DROP(base, value) (ENET_WR_IEEE_T_DROP(base, ENET_RD_IEEE_T_DROP(base) & ~(value)))
#define ENET_TOG_IEEE_T_DROP(base, value) (ENET_WR_IEEE_T_DROP(base, ENET_RD_IEEE_T_DROP(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_FRAME_OK - Frames Transmitted OK (IEEE_T_FRAME_OK)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_FRAME_OK - Frames Transmitted OK (IEEE_T_FRAME_OK) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_FRAME_OK register
 */
/*@{*/
#define ENET_RD_IEEE_T_FRAME_OK(base) (ENET_IEEE_T_FRAME_OK_REG(base))
#define ENET_WR_IEEE_T_FRAME_OK(base, value) (ENET_IEEE_T_FRAME_OK_REG(base) = (value))
#define ENET_RMW_IEEE_T_FRAME_OK(base, mask, value) (ENET_WR_IEEE_T_FRAME_OK(base, (ENET_RD_IEEE_T_FRAME_OK(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_FRAME_OK(base, value) (ENET_WR_IEEE_T_FRAME_OK(base, ENET_RD_IEEE_T_FRAME_OK(base) |  (value)))
#define ENET_CLR_IEEE_T_FRAME_OK(base, value) (ENET_WR_IEEE_T_FRAME_OK(base, ENET_RD_IEEE_T_FRAME_OK(base) & ~(value)))
#define ENET_TOG_IEEE_T_FRAME_OK(base, value) (ENET_WR_IEEE_T_FRAME_OK(base, ENET_RD_IEEE_T_FRAME_OK(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_FRAME_OK bitfields
 */

/*!
 * @name Register ENET_IEEE_T_FRAME_OK, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_FRAME_OK_COUNT field. */
#define ENET_RD_IEEE_T_FRAME_OK_COUNT(base) ((ENET_IEEE_T_FRAME_OK_REG(base) & ENET_IEEE_T_FRAME_OK_COUNT_MASK) >> ENET_IEEE_T_FRAME_OK_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_FRAME_OK_COUNT(base) (ENET_RD_IEEE_T_FRAME_OK_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_1COL - Frames Transmitted with Single Collision (IEEE_T_1COL)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_1COL - Frames Transmitted with Single Collision (IEEE_T_1COL) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_1COL register
 */
/*@{*/
#define ENET_RD_IEEE_T_1COL(base) (ENET_IEEE_T_1COL_REG(base))
#define ENET_WR_IEEE_T_1COL(base, value) (ENET_IEEE_T_1COL_REG(base) = (value))
#define ENET_RMW_IEEE_T_1COL(base, mask, value) (ENET_WR_IEEE_T_1COL(base, (ENET_RD_IEEE_T_1COL(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_1COL(base, value) (ENET_WR_IEEE_T_1COL(base, ENET_RD_IEEE_T_1COL(base) |  (value)))
#define ENET_CLR_IEEE_T_1COL(base, value) (ENET_WR_IEEE_T_1COL(base, ENET_RD_IEEE_T_1COL(base) & ~(value)))
#define ENET_TOG_IEEE_T_1COL(base, value) (ENET_WR_IEEE_T_1COL(base, ENET_RD_IEEE_T_1COL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_1COL bitfields
 */

/*!
 * @name Register ENET_IEEE_T_1COL, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_1COL_COUNT field. */
#define ENET_RD_IEEE_T_1COL_COUNT(base) ((ENET_IEEE_T_1COL_REG(base) & ENET_IEEE_T_1COL_COUNT_MASK) >> ENET_IEEE_T_1COL_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_1COL_COUNT(base) (ENET_RD_IEEE_T_1COL_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_MCOL - Frames Transmitted with Multiple Collisions (IEEE_T_MCOL)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_MCOL - Frames Transmitted with Multiple Collisions (IEEE_T_MCOL) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_MCOL register
 */
/*@{*/
#define ENET_RD_IEEE_T_MCOL(base) (ENET_IEEE_T_MCOL_REG(base))
#define ENET_WR_IEEE_T_MCOL(base, value) (ENET_IEEE_T_MCOL_REG(base) = (value))
#define ENET_RMW_IEEE_T_MCOL(base, mask, value) (ENET_WR_IEEE_T_MCOL(base, (ENET_RD_IEEE_T_MCOL(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_MCOL(base, value) (ENET_WR_IEEE_T_MCOL(base, ENET_RD_IEEE_T_MCOL(base) |  (value)))
#define ENET_CLR_IEEE_T_MCOL(base, value) (ENET_WR_IEEE_T_MCOL(base, ENET_RD_IEEE_T_MCOL(base) & ~(value)))
#define ENET_TOG_IEEE_T_MCOL(base, value) (ENET_WR_IEEE_T_MCOL(base, ENET_RD_IEEE_T_MCOL(base) ^  (value)))
/*@}*/

