RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * ENET_RMON_R_OVERSIZE - RMON Rx Packets > MAX_FL bytes, good CRC (RMON_R_OVERSIZE)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_OVERSIZE - RMON Rx Packets > MAX_FL bytes, good CRC (RMON_R_OVERSIZE) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_OVERSIZE register
 */
/*@{*/
#define ENET_RD_RMON_R_OVERSIZE(base) (ENET_RMON_R_OVERSIZE_REG(base))
#define ENET_WR_RMON_R_OVERSIZE(base, value) (ENET_RMON_R_OVERSIZE_REG(base) = (value))
#define ENET_RMW_RMON_R_OVERSIZE(base, mask, value) (ENET_WR_RMON_R_OVERSIZE(base, (ENET_RD_RMON_R_OVERSIZE(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_OVERSIZE(base, value) (ENET_WR_RMON_R_OVERSIZE(base, ENET_RD_RMON_R_OVERSIZE(base) |  (value)))
#define ENET_CLR_RMON_R_OVERSIZE(base, value) (ENET_WR_RMON_R_OVERSIZE(base, ENET_RD_RMON_R_OVERSIZE(base) & ~(value)))
#define ENET_TOG_RMON_R_OVERSIZE(base, value) (ENET_WR_RMON_R_OVERSIZE(base, ENET_RD_RMON_R_OVERSIZE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_OVERSIZE bitfields
 */

/*!
 * @name Register ENET_RMON_R_OVERSIZE, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_OVERSIZE_COUNT field. */
#define ENET_RD_RMON_R_OVERSIZE_COUNT(base) ((ENET_RMON_R_OVERSIZE_REG(base) & ENET_RMON_R_OVERSIZE_COUNT_MASK) >> ENET_RMON_R_OVERSIZE_COUNT_SHIFT)
#define ENET_BRD_RMON_R_OVERSIZE_COUNT(base) (ENET_RD_RMON_R_OVERSIZE_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_FRAG - RMON Rx Packets < 64 bytes, bad CRC (RMON_R_FRAG)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_FRAG - RMON Rx Packets < 64 bytes, bad CRC (RMON_R_FRAG) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_FRAG register
 */
/*@{*/
#define ENET_RD_RMON_R_FRAG(base) (ENET_RMON_R_FRAG_REG(base))
#define ENET_WR_RMON_R_FRAG(base, value) (ENET_RMON_R_FRAG_REG(base) = (value))
#define ENET_RMW_RMON_R_FRAG(base, mask, value) (ENET_WR_RMON_R_FRAG(base, (ENET_RD_RMON_R_FRAG(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_FRAG(base, value) (ENET_WR_RMON_R_FRAG(base, ENET_RD_RMON_R_FRAG(base) |  (value)))
#define ENET_CLR_RMON_R_FRAG(base, value) (ENET_WR_RMON_R_FRAG(base, ENET_RD_RMON_R_FRAG(base) & ~(value)))
#define ENET_TOG_RMON_R_FRAG(base, value) (ENET_WR_RMON_R_FRAG(base, ENET_RD_RMON_R_FRAG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_FRAG bitfields
 */

/*!
 * @name Register ENET_RMON_R_FRAG, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_FRAG_COUNT field. */
#define ENET_RD_RMON_R_FRAG_COUNT(base) ((ENET_RMON_R_FRAG_REG(base) & ENET_RMON_R_FRAG_COUNT_MASK) >> ENET_RMON_R_FRAG_COUNT_SHIFT)
#define ENET_BRD_RMON_R_FRAG_COUNT(base) (ENET_RD_RMON_R_FRAG_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_JAB - RMON Rx Packets > MAX_FL bytes, bad CRC (RMON_R_JAB)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_JAB - RMON Rx Packets > MAX_FL bytes, bad CRC (RMON_R_JAB) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_JAB register
 */
/*@{*/
#define ENET_RD_RMON_R_JAB(base) (ENET_RMON_R_JAB_REG(base))
#define ENET_WR_RMON_R_JAB(base, value) (ENET_RMON_R_JAB_REG(base) = (value))
#define ENET_RMW_RMON_R_JAB(base, mask, value) (ENET_WR_RMON_R_JAB(base, (ENET_RD_RMON_R_JAB(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_JAB(base, value) (ENET_WR_RMON_R_JAB(base, ENET_RD_RMON_R_JAB(base) |  (value)))
#define ENET_CLR_RMON_R_JAB(base, value) (ENET_WR_RMON_R_JAB(base, ENET_RD_RMON_R_JAB(base) & ~(value)))
#define ENET_TOG_RMON_R_JAB(base, value) (ENET_WR_RMON_R_JAB(base, ENET_RD_RMON_R_JAB(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_JAB bitfields
 */

/*!
 * @name Register ENET_RMON_R_JAB, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_JAB_COUNT field. */
#define ENET_RD_RMON_R_JAB_COUNT(base) ((ENET_RMON_R_JAB_REG(base) & ENET_RMON_R_JAB_COUNT_MASK) >> ENET_RMON_R_JAB_COUNT_SHIFT)
#define ENET_BRD_RMON_R_JAB_COUNT(base) (ENET_RD_RMON_R_JAB_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_RESVD_0 - Reserved (RMON_R_RESVD_0)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_RESVD_0 - Reserved (RMON_R_RESVD_0) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_RESVD_0 register
 */
/*@{*/
#define ENET_RD_RMON_R_RESVD_0(base) (ENET_RMON_R_RESVD_0_REG(base))
#define ENET_WR_RMON_R_RESVD_0(base, value) (ENET_RMON_R_RESVD_0_REG(base) = (value))
#define ENET_RMW_RMON_R_RESVD_0(base, mask, value) (ENET_WR_RMON_R_RESVD_0(base, (ENET_RD_RMON_R_RESVD_0(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_RESVD_0(base, value) (ENET_WR_RMON_R_RESVD_0(base, ENET_RD_RMON_R_RESVD_0(base) |  (value)))
#define ENET_CLR_RMON_R_RESVD_0(base, value) (ENET_WR_RMON_R_RESVD_0(base, ENET_RD_RMON_R_RESVD_0(base) & ~(value)))
#define ENET_TOG_RMON_R_RESVD_0(base, value) (ENET_WR_RMON_R_RESVD_0(base, ENET_RD_RMON_R_RESVD_0(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_P64 - RMON Rx 64 byte packets (RMON_R_P64)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_P64 - RMON Rx 64 byte packets (RMON_R_P64) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_P64 register
 */
/*@{*/
#define ENET_RD_RMON_R_P64(base) (ENET_RMON_R_P64_REG(base))
#define ENET_WR_RMON_R_P64(base, value) (ENET_RMON_R_P64_REG(base) = (value))
#define ENET_RMW_RMON_R_P64(base, mask, value) (ENET_WR_RMON_R_P64(base, (ENET_RD_RMON_R_P64(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_P64(base, value) (ENET_WR_RMON_R_P64(base, ENET_RD_RMON_R_P64(base) |  (value)))
#define ENET_CLR_RMON_R_P64(base, value) (ENET_WR_RMON_R_P64(base, ENET_RD_RMON_R_P64(base) & ~(value)))
#define ENET_TOG_RMON_R_P64(base, value) (ENET_WR_RMON_R_P64(base, ENET_RD_RMON_R_P64(base) ^  (value)))
/*@}*/

