RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*
 * Constants & macros for individual ENET_RMON_R_P512TO1023 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P512TO1023, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_P512TO1023_COUNT field. */
#define ENET_RD_RMON_R_P512TO1023_COUNT(base) ((ENET_RMON_R_P512TO1023_REG(base) & ENET_RMON_R_P512TO1023_COUNT_MASK) >> ENET_RMON_R_P512TO1023_COUNT_SHIFT)
#define ENET_BRD_RMON_R_P512TO1023_COUNT(base) (ENET_RD_RMON_R_P512TO1023_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_P1024TO2047 - RMON Rx 1024 to 2047 byte packets (RMON_R_P1024TO2047)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_P1024TO2047 - RMON Rx 1024 to 2047 byte packets (RMON_R_P1024TO2047) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_P1024TO2047 register
 */
/*@{*/
#define ENET_RD_RMON_R_P1024TO2047(base) (ENET_RMON_R_P1024TO2047_REG(base))
#define ENET_WR_RMON_R_P1024TO2047(base, value) (ENET_RMON_R_P1024TO2047_REG(base) = (value))
#define ENET_RMW_RMON_R_P1024TO2047(base, mask, value) (ENET_WR_RMON_R_P1024TO2047(base, (ENET_RD_RMON_R_P1024TO2047(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_P1024TO2047(base, value) (ENET_WR_RMON_R_P1024TO2047(base, ENET_RD_RMON_R_P1024TO2047(base) |  (value)))
#define ENET_CLR_RMON_R_P1024TO2047(base, value) (ENET_WR_RMON_R_P1024TO2047(base, ENET_RD_RMON_R_P1024TO2047(base) & ~(value)))
#define ENET_TOG_RMON_R_P1024TO2047(base, value) (ENET_WR_RMON_R_P1024TO2047(base, ENET_RD_RMON_R_P1024TO2047(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P1024TO2047 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P1024TO2047, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_P1024TO2047_COUNT field. */
#define ENET_RD_RMON_R_P1024TO2047_COUNT(base) ((ENET_RMON_R_P1024TO2047_REG(base) & ENET_RMON_R_P1024TO2047_COUNT_MASK) >> ENET_RMON_R_P1024TO2047_COUNT_SHIFT)
#define ENET_BRD_RMON_R_P1024TO2047_COUNT(base) (ENET_RD_RMON_R_P1024TO2047_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_P_GTE2048 - RMON Rx packets w > 2048 bytes (RMON_R_P_GTE2048)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_P_GTE2048 - RMON Rx packets w > 2048 bytes (RMON_R_P_GTE2048) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_P_GTE2048 register
 */
/*@{*/
#define ENET_RD_RMON_R_P_GTE2048(base) (ENET_RMON_R_P_GTE2048_REG(base))
#define ENET_WR_RMON_R_P_GTE2048(base, value) (ENET_RMON_R_P_GTE2048_REG(base) = (value))
#define ENET_RMW_RMON_R_P_GTE2048(base, mask, value) (ENET_WR_RMON_R_P_GTE2048(base, (ENET_RD_RMON_R_P_GTE2048(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_P_GTE2048(base, value) (ENET_WR_RMON_R_P_GTE2048(base, ENET_RD_RMON_R_P_GTE2048(base) |  (value)))
#define ENET_CLR_RMON_R_P_GTE2048(base, value) (ENET_WR_RMON_R_P_GTE2048(base, ENET_RD_RMON_R_P_GTE2048(base) & ~(value)))
#define ENET_TOG_RMON_R_P_GTE2048(base, value) (ENET_WR_RMON_R_P_GTE2048(base, ENET_RD_RMON_R_P_GTE2048(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P_GTE2048 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P_GTE2048, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_P_GTE2048_COUNT field. */
#define ENET_RD_RMON_R_P_GTE2048_COUNT(base) ((ENET_RMON_R_P_GTE2048_REG(base) & ENET_RMON_R_P_GTE2048_COUNT_MASK) >> ENET_RMON_R_P_GTE2048_COUNT_SHIFT)
#define ENET_BRD_RMON_R_P_GTE2048_COUNT(base) (ENET_RD_RMON_R_P_GTE2048_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_OCTETS - RMON Rx Octets (RMON_R_OCTETS)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_OCTETS - RMON Rx Octets (RMON_R_OCTETS) (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_OCTETS register
 */
/*@{*/
#define ENET_RD_RMON_R_OCTETS(base) (ENET_RMON_R_OCTETS_REG(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_R_DROP - Count of frames not counted correctly (IEEE_R_DROP). NOTE: Counter increments if a frame with valid/missing SFD character is detected and has been dropped. None of the other counters increments if this counter increments.
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_R_DROP - Count of frames not counted correctly (IEEE_R_DROP). NOTE: Counter increments if a frame with valid/missing SFD character is detected and has been dropped. None of the other counters increments if this counter increments. (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_R_DROP register
 */
/*@{*/
#define ENET_RD_IEEE_R_DROP(base) (ENET_IEEE_R_DROP_REG(base))
#define ENET_WR_IEEE_R_DROP(base, value) (ENET_IEEE_R_DROP_REG(base) = (value))
#define ENET_RMW_IEEE_R_DROP(base, mask, value) (ENET_WR_IEEE_R_DROP(base, (ENET_RD_IEEE_R_DROP(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_R_DROP(base, value) (ENET_WR_IEEE_R_DROP(base, ENET_RD_IEEE_R_DROP(base) |  (value)))
#define ENET_CLR_IEEE_R_DROP(base, value) (ENET_WR_IEEE_R_DROP(base, ENET_RD_IEEE_R_DROP(base) & ~(value)))
#define ENET_TOG_IEEE_R_DROP(base, value) (ENET_WR_IEEE_R_DROP(base, ENET_RD_IEEE_R_DROP(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_DROP bitfields
 */

/*!
 * @name Register ENET_IEEE_R_DROP, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_R_DROP_COUNT field. */
#define ENET_RD_IEEE_R_DROP_COUNT(base) ((ENET_IEEE_R_DROP_REG(base) & ENET_IEEE_R_DROP_COUNT_MASK) >> ENET_IEEE_R_DROP_COUNT_SHIFT)
#define ENET_BRD_IEEE_R_DROP_COUNT(base) (ENET_RD_IEEE_R_DROP_COUNT(base))
/*@}*/

