RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * ENET_IEEE_R_FRAME_OK - Frames Received OK (IEEE_R_FRAME_OK)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_R_FRAME_OK - Frames Received OK (IEEE_R_FRAME_OK) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_R_FRAME_OK register
 */
/*@{*/
#define ENET_RD_IEEE_R_FRAME_OK(base) (ENET_IEEE_R_FRAME_OK_REG(base))
#define ENET_WR_IEEE_R_FRAME_OK(base, value) (ENET_IEEE_R_FRAME_OK_REG(base) = (value))
#define ENET_RMW_IEEE_R_FRAME_OK(base, mask, value) (ENET_WR_IEEE_R_FRAME_OK(base, (ENET_RD_IEEE_R_FRAME_OK(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_R_FRAME_OK(base, value) (ENET_WR_IEEE_R_FRAME_OK(base, ENET_RD_IEEE_R_FRAME_OK(base) |  (value)))
#define ENET_CLR_IEEE_R_FRAME_OK(base, value) (ENET_WR_IEEE_R_FRAME_OK(base, ENET_RD_IEEE_R_FRAME_OK(base) & ~(value)))
#define ENET_TOG_IEEE_R_FRAME_OK(base, value) (ENET_WR_IEEE_R_FRAME_OK(base, ENET_RD_IEEE_R_FRAME_OK(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_FRAME_OK bitfields
 */

/*!
 * @name Register ENET_IEEE_R_FRAME_OK, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_R_FRAME_OK_COUNT field. */
#define ENET_RD_IEEE_R_FRAME_OK_COUNT(base) ((ENET_IEEE_R_FRAME_OK_REG(base) & ENET_IEEE_R_FRAME_OK_COUNT_MASK) >> ENET_IEEE_R_FRAME_OK_COUNT_SHIFT)
#define ENET_BRD_IEEE_R_FRAME_OK_COUNT(base) (ENET_RD_IEEE_R_FRAME_OK_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_R_CRC - Frames Received with CRC Error (IEEE_R_CRC)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_R_CRC - Frames Received with CRC Error (IEEE_R_CRC) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_R_CRC register
 */
/*@{*/
#define ENET_RD_IEEE_R_CRC(base) (ENET_IEEE_R_CRC_REG(base))
#define ENET_WR_IEEE_R_CRC(base, value) (ENET_IEEE_R_CRC_REG(base) = (value))
#define ENET_RMW_IEEE_R_CRC(base, mask, value) (ENET_WR_IEEE_R_CRC(base, (ENET_RD_IEEE_R_CRC(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_R_CRC(base, value) (ENET_WR_IEEE_R_CRC(base, ENET_RD_IEEE_R_CRC(base) |  (value)))
#define ENET_CLR_IEEE_R_CRC(base, value) (ENET_WR_IEEE_R_CRC(base, ENET_RD_IEEE_R_CRC(base) & ~(value)))
#define ENET_TOG_IEEE_R_CRC(base, value) (ENET_WR_IEEE_R_CRC(base, ENET_RD_IEEE_R_CRC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_CRC bitfields
 */

/*!
 * @name Register ENET_IEEE_R_CRC, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_R_CRC_COUNT field. */
#define ENET_RD_IEEE_R_CRC_COUNT(base) ((ENET_IEEE_R_CRC_REG(base) & ENET_IEEE_R_CRC_COUNT_MASK) >> ENET_IEEE_R_CRC_COUNT_SHIFT)
#define ENET_BRD_IEEE_R_CRC_COUNT(base) (ENET_RD_IEEE_R_CRC_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_R_ALIGN - Frames Received with Alignment Error (IEEE_R_ALIGN)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_R_ALIGN - Frames Received with Alignment Error (IEEE_R_ALIGN) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_R_ALIGN register
 */
/*@{*/
#define ENET_RD_IEEE_R_ALIGN(base) (ENET_IEEE_R_ALIGN_REG(base))
#define ENET_WR_IEEE_R_ALIGN(base, value) (ENET_IEEE_R_ALIGN_REG(base) = (value))
#define ENET_RMW_IEEE_R_ALIGN(base, mask, value) (ENET_WR_IEEE_R_ALIGN(base, (ENET_RD_IEEE_R_ALIGN(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_R_ALIGN(base, value) (ENET_WR_IEEE_R_ALIGN(base, ENET_RD_IEEE_R_ALIGN(base) |  (value)))
#define ENET_CLR_IEEE_R_ALIGN(base, value) (ENET_WR_IEEE_R_ALIGN(base, ENET_RD_IEEE_R_ALIGN(base) & ~(value)))
#define ENET_TOG_IEEE_R_ALIGN(base, value) (ENET_WR_IEEE_R_ALIGN(base, ENET_RD_IEEE_R_ALIGN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_ALIGN bitfields
 */

/*!
 * @name Register ENET_IEEE_R_ALIGN, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_R_ALIGN_COUNT field. */
#define ENET_RD_IEEE_R_ALIGN_COUNT(base) ((ENET_IEEE_R_ALIGN_REG(base) & ENET_IEEE_R_ALIGN_COUNT_MASK) >> ENET_IEEE_R_ALIGN_COUNT_SHIFT)
#define ENET_BRD_IEEE_R_ALIGN_COUNT(base) (ENET_RD_IEEE_R_ALIGN_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_R_MACERR - Receive Fifo Overflow count (IEEE_R_MACERR)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_R_MACERR - Receive Fifo Overflow count (IEEE_R_MACERR) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_R_MACERR register
 */
/*@{*/
#define ENET_RD_IEEE_R_MACERR(base) (ENET_IEEE_R_MACERR_REG(base))
#define ENET_WR_IEEE_R_MACERR(base, value) (ENET_IEEE_R_MACERR_REG(base) = (value))
#define ENET_RMW_IEEE_R_MACERR(base, mask, value) (ENET_WR_IEEE_R_MACERR(base, (ENET_RD_IEEE_R_MACERR(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_R_MACERR(base, value) (ENET_WR_IEEE_R_MACERR(base, ENET_RD_IEEE_R_MACERR(base) |  (value)))
#define ENET_CLR_IEEE_R_MACERR(base, value) (ENET_WR_IEEE_R_MACERR(base, ENET_RD_IEEE_R_MACERR(base) & ~(value)))
#define ENET_TOG_IEEE_R_MACERR(base, value) (ENET_WR_IEEE_R_MACERR(base, ENET_RD_IEEE_R_MACERR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_MACERR bitfields
 */

/*!
 * @name Register ENET_IEEE_R_MACERR, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_R_MACERR_COUNT field. */
#define ENET_RD_IEEE_R_MACERR_COUNT(base) ((ENET_IEEE_R_MACERR_REG(base) & ENET_IEEE_R_MACERR_COUNT_MASK) >> ENET_IEEE_R_MACERR_COUNT_SHIFT)
#define ENET_BRD_IEEE_R_MACERR_COUNT(base) (ENET_RD_IEEE_R_MACERR_COUNT(base))
/*@}*/

