RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * ENET_IEEE_R_FDXFC - Flow Control Pause frames received (IEEE_R_FDXFC)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_R_FDXFC - Flow Control Pause frames received (IEEE_R_FDXFC) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_R_FDXFC register
 */
/*@{*/
#define ENET_RD_IEEE_R_FDXFC(base) (ENET_IEEE_R_FDXFC_REG(base))
#define ENET_WR_IEEE_R_FDXFC(base, value) (ENET_IEEE_R_FDXFC_REG(base) = (value))
#define ENET_RMW_IEEE_R_FDXFC(base, mask, value) (ENET_WR_IEEE_R_FDXFC(base, (ENET_RD_IEEE_R_FDXFC(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_R_FDXFC(base, value) (ENET_WR_IEEE_R_FDXFC(base, ENET_RD_IEEE_R_FDXFC(base) |  (value)))
#define ENET_CLR_IEEE_R_FDXFC(base, value) (ENET_WR_IEEE_R_FDXFC(base, ENET_RD_IEEE_R_FDXFC(base) & ~(value)))
#define ENET_TOG_IEEE_R_FDXFC(base, value) (ENET_WR_IEEE_R_FDXFC(base, ENET_RD_IEEE_R_FDXFC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_FDXFC bitfields
 */

/*!
 * @name Register ENET_IEEE_R_FDXFC, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_R_FDXFC_COUNT field. */
#define ENET_RD_IEEE_R_FDXFC_COUNT(base) ((ENET_IEEE_R_FDXFC_REG(base) & ENET_IEEE_R_FDXFC_COUNT_MASK) >> ENET_IEEE_R_FDXFC_COUNT_SHIFT)
#define ENET_BRD_IEEE_R_FDXFC_COUNT(base) (ENET_RD_IEEE_R_FDXFC_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_R_OCTETS_OK - Octet count for Frames Rcvd w/o Error (IEEE_R_OCTETS_OK). Counts total octets (includes header and FCS fields).
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_R_OCTETS_OK - Octet count for Frames Rcvd w/o Error (IEEE_R_OCTETS_OK). Counts total octets (includes header and FCS fields). (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_R_OCTETS_OK register
 */
/*@{*/
#define ENET_RD_IEEE_R_OCTETS_OK(base) (ENET_IEEE_R_OCTETS_OK_REG(base))
/*@}*/

/*******************************************************************************
 * ENET_ATCR - Timer Control Register
 ******************************************************************************/

/*!
 * @brief ENET_ATCR - Timer Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * ATCR command fields can trigger the corresponding events directly. It is not
 * necessary to preserve any of the configuration fields when a command field is
 * set in the register, that is, no read-modify-write is required. The fields are
 * automatically cleared after the command completes.
 */
/*!
 * @name Constants and macros for entire ENET_ATCR register
 */
/*@{*/
#define ENET_RD_ATCR(base)       (ENET_ATCR_REG(base))
#define ENET_WR_ATCR(base, value) (ENET_ATCR_REG(base) = (value))
#define ENET_RMW_ATCR(base, mask, value) (ENET_WR_ATCR(base, (ENET_RD_ATCR(base) & ~(mask)) | (value)))
#define ENET_SET_ATCR(base, value) (ENET_WR_ATCR(base, ENET_RD_ATCR(base) |  (value)))
#define ENET_CLR_ATCR(base, value) (ENET_WR_ATCR(base, ENET_RD_ATCR(base) & ~(value)))
#define ENET_TOG_ATCR(base, value) (ENET_WR_ATCR(base, ENET_RD_ATCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_ATCR bitfields
 */

/*!
 * @name Register ENET_ATCR, field EN[0] (RW)
 *
 * Values:
 * - 0b0 - The timer stops at the current value.
 * - 0b1 - The timer starts incrementing.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_EN field. */
#define ENET_RD_ATCR_EN(base) ((ENET_ATCR_REG(base) & ENET_ATCR_EN_MASK) >> ENET_ATCR_EN_SHIFT)
#define ENET_BRD_ATCR_EN(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_EN_SHIFT))

/*! @brief Set the EN field to a new value. */
#define ENET_WR_ATCR_EN(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_EN_MASK, ENET_ATCR_EN(value)))
#define ENET_BWR_ATCR_EN(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field OFFEN[2] (RW)
 *
 * Values:
 * - 0b0 - Disable.
 * - 0b1 - The timer can be reset to zero when the given offset time is reached
 *     (offset event). The field is cleared when the offset event is reached, so
 *     no further event occurs until the field is set again. The timer offset
 *     value must be set before setting this field.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_OFFEN field. */
#define ENET_RD_ATCR_OFFEN(base) ((ENET_ATCR_REG(base) & ENET_ATCR_OFFEN_MASK) >> ENET_ATCR_OFFEN_SHIFT)
#define ENET_BRD_ATCR_OFFEN(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_OFFEN_SHIFT))

/*! @brief Set the OFFEN field to a new value. */
#define ENET_WR_ATCR_OFFEN(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_OFFEN_MASK, ENET_ATCR_OFFEN(value)))
#define ENET_BWR_ATCR_OFFEN(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_OFFEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field OFFRST[3] (RW)
 *
 * Values:
 * - 0b0 - The timer is not affected and no action occurs, besides clearing
 *     OFFEN, when the offset is reached.
 * - 0b1 - If OFFEN is set, the timer resets to zero when the offset setting is
 *     reached. The offset event does not cause a timer interrupt.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_OFFRST field. */
#define ENET_RD_ATCR_OFFRST(base) ((ENET_ATCR_REG(base) & ENET_ATCR_OFFRST_MASK) >> ENET_ATCR_OFFRST_SHIFT)
#define ENET_BRD_ATCR_OFFRST(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_OFFRST_SHIFT))

/*! @brief Set the OFFRST field to a new value. */
#define ENET_WR_ATCR_OFFRST(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_OFFRST_MASK, ENET_ATCR_OFFRST(value)))
#define ENET_BWR_ATCR_OFFRST(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_OFFRST_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field PEREN[4] (RW)
 *
 * Values:
 * - 0b0 - Disable.
 * - 0b1 - A period event interrupt can be generated (EIR[TS_TIMER]) and the
 *     event signal output is asserted when the timer wraps around according to the
 *     periodic setting ATPER. The timer period value must be set before setting
 *     this bit. Not all devices contain the event signal output. See the chip
 *     configuration details.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_PEREN field. */
#define ENET_RD_ATCR_PEREN(base) ((ENET_ATCR_REG(base) & ENET_ATCR_PEREN_MASK) >> ENET_ATCR_PEREN_SHIFT)
#define ENET_BRD_ATCR_PEREN(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_PEREN_SHIFT))

/*! @brief Set the PEREN field to a new value. */
#define ENET_WR_ATCR_PEREN(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_PEREN_MASK, ENET_ATCR_PEREN(value)))
#define ENET_BWR_ATCR_PEREN(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_PEREN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field PINPER[7] (RW)
 *
 * Enables event signal output assertion on period event. Not all devices
 * contain the event signal output. See the chip configuration details.
 *
 * Values:
 * - 0b0 - Disable.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_PINPER field. */
#define ENET_RD_ATCR_PINPER(base) ((ENET_ATCR_REG(base) & ENET_ATCR_PINPER_MASK) >> ENET_ATCR_PINPER_SHIFT)
#define ENET_BRD_ATCR_PINPER(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_PINPER_SHIFT))

/*! @brief Set the PINPER field to a new value. */
#define ENET_WR_ATCR_PINPER(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_PINPER_MASK, ENET_ATCR_PINPER(value)))
#define ENET_BWR_ATCR_PINPER(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_PINPER_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field RESTART[9] (RW)
 *
 * Resets the timer to zero. This has no effect on the counter enable. If the
 * counter is enabled when this field is set, the timer is reset to zero and starts
 * counting from there. When set, all other fields are ignored during a write.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_RESTART field. */
#define ENET_RD_ATCR_RESTART(base) ((ENET_ATCR_REG(base) & ENET_ATCR_RESTART_MASK) >> ENET_ATCR_RESTART_SHIFT)
#define ENET_BRD_ATCR_RESTART(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_RESTART_SHIFT))

/*! @brief Set the RESTART field to a new value. */
#define ENET_WR_ATCR_RESTART(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_RESTART_MASK, ENET_ATCR_RESTART(value)))
#define ENET_BWR_ATCR_RESTART(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_RESTART_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field CAPTURE[11] (RW)
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - The current time is captured and can be read from the ATVR register.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_CAPTURE field. */
#define ENET_RD_ATCR_CAPTURE(base) ((ENET_ATCR_REG(base) & ENET_ATCR_CAPTURE_MASK) >> ENET_ATCR_CAPTURE_SHIFT)
#define ENET_BRD_ATCR_CAPTURE(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_CAPTURE_SHIFT))

/*! @brief Set the CAPTURE field to a new value. */
#define ENET_WR_ATCR_CAPTURE(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_CAPTURE_MASK, ENET_ATCR_CAPTURE(value)))
#define ENET_BWR_ATCR_CAPTURE(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_CAPTURE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_ATCR, field SLAVE[13] (RW)
 *
 * Values:
 * - 0b0 - The timer is active and all configuration fields in this register are
 *     relevant.
 * - 0b1 - The internal timer is disabled and the externally provided timer
 *     value is used. All other fields, except CAPTURE, in this register have no
 *     effect. CAPTURE can still be used to capture the current timer value.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCR_SLAVE field. */
#define ENET_RD_ATCR_SLAVE(base) ((ENET_ATCR_REG(base) & ENET_ATCR_SLAVE_MASK) >> ENET_ATCR_SLAVE_SHIFT)
#define ENET_BRD_ATCR_SLAVE(base) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_SLAVE_SHIFT))

