RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*! @brief Set the VSUPPLY field to a new value. */
#define LCD_WR_GCR_VSUPPLY(base, value) (LCD_RMW_GCR(base, LCD_GCR_VSUPPLY_MASK, LCD_GCR_VSUPPLY(value)))
#define LCD_BWR_GCR_VSUPPLY(base, value) (LCD_WR_GCR_VSUPPLY(base, value))
/*@}*/

/*!
 * @name Register LCD_GCR, field LADJ[21:20] (RW)
 *
 * Configures SLCD to handle different LCD glass capacitance. For CPSEL = 0
 * Adjust the resistor bias network for different LCD glass capacitance. 00 - Low
 * Load (LCD glass capacitance 2000 pF or lower). 01 - Low Load (LCD glass
 * capacitance 2000 pF or lower). 10 - High Load (LCD glass capacitance 8000 pF or lower).
 * 11 - High Load (LCD glass capacitance 8000 pF or lower). For CPSEL = 1 Adjust
 * the clock source for the charge pump. Higher loads require higher charge pump
 * clock rates. 00 - Fastest clock source for charge pump (LCD glass capacitance
 * 8000 pF or lower). 01 - Intermediate clock source for charge pump (LCD glass
 * capacitance 6000 pF or lower). 10 - Intermediate clock source for charge pump
 * (LCD glass capacitance 4000 pF or lower). 11 - Slowest clock source for charge
 * pump (LCD glass capacitance 2000 pF or lower).
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LADJ field. */
#define LCD_RD_GCR_LADJ(base) ((LCD_GCR_REG(base) & LCD_GCR_LADJ_MASK) >> LCD_GCR_LADJ_SHIFT)
#define LCD_BRD_GCR_LADJ(base) (LCD_RD_GCR_LADJ(base))

/*! @brief Set the LADJ field to a new value. */
#define LCD_WR_GCR_LADJ(base, value) (LCD_RMW_GCR(base, LCD_GCR_LADJ_MASK, LCD_GCR_LADJ(value)))
#define LCD_BWR_GCR_LADJ(base, value) (LCD_WR_GCR_LADJ(base, value))
/*@}*/

/*!
 * @name Register LCD_GCR, field HREFSEL[22] (RW)
 *
 * When using the V IREG inputs, this bit configures internal circuits to supply
 * V LL1 .
 *
 * Values:
 * - 0b0 - Divide input, V IREG = 1.0 V for 3 V glass.
 * - 0b1 - Do not divide the input, V IREG = 1.67 V for 5 V glass.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_HREFSEL field. */
#define LCD_RD_GCR_HREFSEL(base) ((LCD_GCR_REG(base) & LCD_GCR_HREFSEL_MASK) >> LCD_GCR_HREFSEL_SHIFT)
#define LCD_BRD_GCR_HREFSEL(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_HREFSEL_SHIFT))

/*! @brief Set the HREFSEL field to a new value. */
#define LCD_WR_GCR_HREFSEL(base, value) (LCD_RMW_GCR(base, LCD_GCR_HREFSEL_MASK, LCD_GCR_HREFSEL(value)))
#define LCD_BWR_GCR_HREFSEL(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_HREFSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_GCR, field CPSEL[23] (RW)
 *
 * Selects the LCD controller charge pump or a resistor network to supply the
 * LCD voltages V LL1 , V LL2 , and V LL3 .
 *
 * Values:
 * - 0b0 - LCD charge pump is disabled. Resistor network selected. (The internal
 *     1/3-bias is forced.)
 * - 0b1 - LCD charge pump is selected. Resistor network disabled. (The internal
 *     1/3-bias is forced.)
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_CPSEL field. */
#define LCD_RD_GCR_CPSEL(base) ((LCD_GCR_REG(base) & LCD_GCR_CPSEL_MASK) >> LCD_GCR_CPSEL_SHIFT)
#define LCD_BRD_GCR_CPSEL(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_CPSEL_SHIFT))

/*! @brief Set the CPSEL field to a new value. */
#define LCD_WR_GCR_CPSEL(base, value) (LCD_RMW_GCR(base, LCD_GCR_CPSEL_MASK, LCD_GCR_CPSEL(value)))
#define LCD_BWR_GCR_CPSEL(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_CPSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_GCR, field RVTRIM[27:24] (RW)
 *
 * This 4-bit trim register is used to adjust the regulated input. Each bit in
 * the register has equal weight. The regulated input is changed by 1.5% for each
 * count.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_RVTRIM field. */
#define LCD_RD_GCR_RVTRIM(base) ((LCD_GCR_REG(base) & LCD_GCR_RVTRIM_MASK) >> LCD_GCR_RVTRIM_SHIFT)
#define LCD_BRD_GCR_RVTRIM(base) (LCD_RD_GCR_RVTRIM(base))

/*! @brief Set the RVTRIM field to a new value. */
#define LCD_WR_GCR_RVTRIM(base, value) (LCD_RMW_GCR(base, LCD_GCR_RVTRIM_MASK, LCD_GCR_RVTRIM(value)))
#define LCD_BWR_GCR_RVTRIM(base, value) (LCD_WR_GCR_RVTRIM(base, value))
/*@}*/

/*!
 * @name Register LCD_GCR, field RVEN[31] (RW)
 *
 * Enables internal voltage regulator. It must have the charge pump enabled.
 *
 * Values:
 * - 0b0 - Regulated voltage disabled.
 * - 0b1 - Regulated voltage enabled.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_RVEN field. */
#define LCD_RD_GCR_RVEN(base) ((LCD_GCR_REG(base) & LCD_GCR_RVEN_MASK) >> LCD_GCR_RVEN_SHIFT)
#define LCD_BRD_GCR_RVEN(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_RVEN_SHIFT))

/*! @brief Set the RVEN field to a new value. */
#define LCD_WR_GCR_RVEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_RVEN_MASK, LCD_GCR_RVEN(value)))
#define LCD_BWR_GCR_RVEN(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_RVEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCD_AR - LCD Auxiliary Register
 ******************************************************************************/

/*!
 * @brief LCD_AR - LCD Auxiliary Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
/*!
 * @name Constants and macros for entire LCD_AR register
 */
/*@{*/
#define LCD_RD_AR(base)          (LCD_AR_REG(base))
#define LCD_WR_AR(base, value)   (LCD_AR_REG(base) = (value))
#define LCD_RMW_AR(base, mask, value) (LCD_WR_AR(base, (LCD_RD_AR(base) & ~(mask)) | (value)))
#define LCD_SET_AR(base, value)  (LCD_WR_AR(base, LCD_RD_AR(base) |  (value)))
#define LCD_CLR_AR(base, value)  (LCD_WR_AR(base, LCD_RD_AR(base) & ~(value)))
#define LCD_TOG_AR(base, value)  (LCD_WR_AR(base, LCD_RD_AR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCD_AR bitfields
 */

/*!
 * @name Register LCD_AR, field BRATE[2:0] (RW)
 *
 * Selects frequency at which the LCD blinks when the BLINK bit is asserted. The
 * following equation provides an expression for the LCD controller blink rate
 * and shows how BRATE field is used in the LCD blink-rate calculation. LCD
 * controller blink rate = LCD clock / 2 (12 + BRATE)
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_BRATE field. */
#define LCD_RD_AR_BRATE(base) ((LCD_AR_REG(base) & LCD_AR_BRATE_MASK) >> LCD_AR_BRATE_SHIFT)
#define LCD_BRD_AR_BRATE(base) (LCD_RD_AR_BRATE(base))

/*! @brief Set the BRATE field to a new value. */
#define LCD_WR_AR_BRATE(base, value) (LCD_RMW_AR(base, (LCD_AR_BRATE_MASK | LCD_AR_LCDIF_MASK), LCD_AR_BRATE(value)))
#define LCD_BWR_AR_BRATE(base, value) (LCD_WR_AR_BRATE(base, value))
/*@}*/

/*!
 * @name Register LCD_AR, field BMODE[3] (RW)
 *
 * Selects the blink mode displayed during the blink period.
 *
 * Values:
 * - 0b0 - Display blank during the blink period.
 * - 0b1 - Display alternate display during blink period (Ignored if duty is 5
 *     or greater).
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_BMODE field. */
#define LCD_RD_AR_BMODE(base) ((LCD_AR_REG(base) & LCD_AR_BMODE_MASK) >> LCD_AR_BMODE_SHIFT)
#define LCD_BRD_AR_BMODE(base) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_BMODE_SHIFT))

/*! @brief Set the BMODE field to a new value. */
#define LCD_WR_AR_BMODE(base, value) (LCD_RMW_AR(base, (LCD_AR_BMODE_MASK | LCD_AR_LCDIF_MASK), LCD_AR_BMODE(value)))
#define LCD_BWR_AR_BMODE(base, value) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_BMODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_AR, field BLANK[5] (RW)
 *
 * Asserting this bit clears all segments in the LCD.
 *
 * Values:
 * - 0b0 - Normal or alternate display mode.
 * - 0b1 - Blank display mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_BLANK field. */
#define LCD_RD_AR_BLANK(base) ((LCD_AR_REG(base) & LCD_AR_BLANK_MASK) >> LCD_AR_BLANK_SHIFT)
#define LCD_BRD_AR_BLANK(base) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_BLANK_SHIFT))

