RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*! @brief Set the WF10 field to a new value. */
#define LCD_WR_WF_WF10(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF10_MASK, LCD_WF_WF10(value)))
#define LCD_BWR_WF_WF10(base, index, value) (LCD_WR_WF_WF10(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF63[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P63 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF63 field. */
#define LCD_RD_WF_WF63(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF63_MASK) >> LCD_WF_WF63_SHIFT)
#define LCD_BRD_WF_WF63(base, index) (LCD_RD_WF_WF63(base, index))

/*! @brief Set the WF63 field to a new value. */
#define LCD_WR_WF_WF63(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF63_MASK, LCD_WF_WF63(value)))
#define LCD_BWR_WF_WF63(base, index, value) (LCD_WR_WF_WF63(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF59[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P59 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF59 field. */
#define LCD_RD_WF_WF59(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF59_MASK) >> LCD_WF_WF59_SHIFT)
#define LCD_BRD_WF_WF59(base, index) (LCD_RD_WF_WF59(base, index))

/*! @brief Set the WF59 field to a new value. */
#define LCD_WR_WF_WF59(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF59_MASK, LCD_WF_WF59(value)))
#define LCD_BWR_WF_WF59(base, index, value) (LCD_WR_WF_WF59(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF55[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P55 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF55 field. */
#define LCD_RD_WF_WF55(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF55_MASK) >> LCD_WF_WF55_SHIFT)
#define LCD_BRD_WF_WF55(base, index) (LCD_RD_WF_WF55(base, index))

/*! @brief Set the WF55 field to a new value. */
#define LCD_WR_WF_WF55(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF55_MASK, LCD_WF_WF55(value)))
#define LCD_BWR_WF_WF55(base, index, value) (LCD_WR_WF_WF55(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF3[31:24] (RW)
 *
 * Segment-on front plane operation - Each bit turns on or off the segments
 * associated with LCD_P3 in the following pattern: HGFEDCBA (most significant bit
 * controls segment H and least significant bit controls segment A). Segment-on
 * back plane operation - Each bit activates or deactivates the phases associated
 * with LCD_P3 in the following pattern: HGFEDCBA (most significant bit controls
 * phase H and least significant bit controls phase A). For each bit: 0 Segment off
 * or phase deactivated 1 Segment on or phase activated
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF3 field. */
#define LCD_RD_WF_WF3(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF3_MASK) >> LCD_WF_WF3_SHIFT)
#define LCD_BRD_WF_WF3(base, index) (LCD_RD_WF_WF3(base, index))

/*! @brief Set the WF3 field to a new value. */
#define LCD_WR_WF_WF3(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF3_MASK, LCD_WF_WF3(value)))
#define LCD_BWR_WF_WF3(base, index, value) (LCD_WR_WF_WF3(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF51[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P51 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF51 field. */
#define LCD_RD_WF_WF51(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF51_MASK) >> LCD_WF_WF51_SHIFT)
#define LCD_BRD_WF_WF51(base, index) (LCD_RD_WF_WF51(base, index))

/*! @brief Set the WF51 field to a new value. */
#define LCD_WR_WF_WF51(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF51_MASK, LCD_WF_WF51(value)))
#define LCD_BWR_WF_WF51(base, index, value) (LCD_WR_WF_WF51(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF47[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P47 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF47 field. */
#define LCD_RD_WF_WF47(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF47_MASK) >> LCD_WF_WF47_SHIFT)
#define LCD_BRD_WF_WF47(base, index) (LCD_RD_WF_WF47(base, index))

/*! @brief Set the WF47 field to a new value. */
#define LCD_WR_WF_WF47(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF47_MASK, LCD_WF_WF47(value)))
#define LCD_BWR_WF_WF47(base, index, value) (LCD_WR_WF_WF47(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF43[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P43 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF43 field. */
#define LCD_RD_WF_WF43(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF43_MASK) >> LCD_WF_WF43_SHIFT)
#define LCD_BRD_WF_WF43(base, index) (LCD_RD_WF_WF43(base, index))

/*! @brief Set the WF43 field to a new value. */
#define LCD_WR_WF_WF43(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF43_MASK, LCD_WF_WF43(value)))
#define LCD_BWR_WF_WF43(base, index, value) (LCD_WR_WF_WF43(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF7[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P7 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF7 field. */
#define LCD_RD_WF_WF7(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF7_MASK) >> LCD_WF_WF7_SHIFT)
#define LCD_BRD_WF_WF7(base, index) (LCD_RD_WF_WF7(base, index))

/*! @brief Set the WF7 field to a new value. */
#define LCD_WR_WF_WF7(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF7_MASK, LCD_WF_WF7(value)))
#define LCD_BWR_WF_WF7(base, index, value) (LCD_WR_WF_WF7(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF39[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P39 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF39 field. */
#define LCD_RD_WF_WF39(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF39_MASK) >> LCD_WF_WF39_SHIFT)
#define LCD_BRD_WF_WF39(base, index) (LCD_RD_WF_WF39(base, index))

/*! @brief Set the WF39 field to a new value. */
#define LCD_WR_WF_WF39(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF39_MASK, LCD_WF_WF39(value)))
#define LCD_BWR_WF_WF39(base, index, value) (LCD_WR_WF_WF39(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF35[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P35 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF35 field. */
#define LCD_RD_WF_WF35(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF35_MASK) >> LCD_WF_WF35_SHIFT)
#define LCD_BRD_WF_WF35(base, index) (LCD_RD_WF_WF35(base, index))

/*! @brief Set the WF35 field to a new value. */
#define LCD_WR_WF_WF35(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF35_MASK, LCD_WF_WF35(value)))
#define LCD_BWR_WF_WF35(base, index, value) (LCD_WR_WF_WF35(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF31[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P31 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF31 field. */
#define LCD_RD_WF_WF31(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF31_MASK) >> LCD_WF_WF31_SHIFT)
#define LCD_BRD_WF_WF31(base, index) (LCD_RD_WF_WF31(base, index))

/*! @brief Set the WF31 field to a new value. */
#define LCD_WR_WF_WF31(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF31_MASK, LCD_WF_WF31(value)))
#define LCD_BWR_WF_WF31(base, index, value) (LCD_WR_WF_WF31(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF11[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P11 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF11 field. */
#define LCD_RD_WF_WF11(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF11_MASK) >> LCD_WF_WF11_SHIFT)
#define LCD_BRD_WF_WF11(base, index) (LCD_RD_WF_WF11(base, index))

/*! @brief Set the WF11 field to a new value. */
#define LCD_WR_WF_WF11(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF11_MASK, LCD_WF_WF11(value)))
#define LCD_BWR_WF_WF11(base, index, value) (LCD_WR_WF_WF11(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF27[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P27 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF27 field. */
#define LCD_RD_WF_WF27(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF27_MASK) >> LCD_WF_WF27_SHIFT)
#define LCD_BRD_WF_WF27(base, index) (LCD_RD_WF_WF27(base, index))

/*! @brief Set the WF27 field to a new value. */
#define LCD_WR_WF_WF27(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF27_MASK, LCD_WF_WF27(value)))
#define LCD_BWR_WF_WF27(base, index, value) (LCD_WR_WF_WF27(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF23[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P23 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF23 field. */
#define LCD_RD_WF_WF23(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF23_MASK) >> LCD_WF_WF23_SHIFT)
#define LCD_BRD_WF_WF23(base, index) (LCD_RD_WF_WF23(base, index))

/*! @brief Set the WF23 field to a new value. */
#define LCD_WR_WF_WF23(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF23_MASK, LCD_WF_WF23(value)))
#define LCD_BWR_WF_WF23(base, index, value) (LCD_WR_WF_WF23(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF19[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P19 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF19 field. */
#define LCD_RD_WF_WF19(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF19_MASK) >> LCD_WF_WF19_SHIFT)
#define LCD_BRD_WF_WF19(base, index) (LCD_RD_WF_WF19(base, index))

/*! @brief Set the WF19 field to a new value. */
#define LCD_WR_WF_WF19(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF19_MASK, LCD_WF_WF19(value)))
#define LCD_BWR_WF_WF19(base, index, value) (LCD_WR_WF_WF19(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF15[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P15 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF15 field. */
#define LCD_RD_WF_WF15(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF15_MASK) >> LCD_WF_WF15_SHIFT)
#define LCD_BRD_WF_WF15(base, index) (LCD_RD_WF_WF15(base, index))

/*! @brief Set the WF15 field to a new value. */
#define LCD_WR_WF_WF15(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF15_MASK, LCD_WF_WF15(value)))
#define LCD_BWR_WF_WF15(base, index, value) (LCD_WR_WF_WF15(base, index, value))
/*@}*/

