RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*! @brief Set the BPBLCD34 field to a new value. */
#define LCD_WR_WF8B_BPBLCD34(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD34_MASK, LCD_WF8B_BPBLCD34(value)))
#define LCD_BWR_WF8B_BPBLCD34(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD34_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD39[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD39 field. */
#define LCD_RD_WF8B_BPBLCD39(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD39_MASK) >> LCD_WF8B_BPBLCD39_SHIFT)
#define LCD_BRD_WF8B_BPBLCD39(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD39_SHIFT))

/*! @brief Set the BPBLCD39 field to a new value. */
#define LCD_WR_WF8B_BPBLCD39(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD39_MASK, LCD_WF8B_BPBLCD39(value)))
#define LCD_BWR_WF8B_BPBLCD39(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD39_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD59[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD59 field. */
#define LCD_RD_WF8B_BPBLCD59(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD59_MASK) >> LCD_WF8B_BPBLCD59_SHIFT)
#define LCD_BRD_WF8B_BPBLCD59(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD59_SHIFT))

/*! @brief Set the BPBLCD59 field to a new value. */
#define LCD_WR_WF8B_BPBLCD59(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD59_MASK, LCD_WF8B_BPBLCD59(value)))
#define LCD_BWR_WF8B_BPBLCD59(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD59_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD61[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD61 field. */
#define LCD_RD_WF8B_BPBLCD61(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD61_MASK) >> LCD_WF8B_BPBLCD61_SHIFT)
#define LCD_BRD_WF8B_BPBLCD61(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD61_SHIFT))

/*! @brief Set the BPBLCD61 field to a new value. */
#define LCD_WR_WF8B_BPBLCD61(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD61_MASK, LCD_WF8B_BPBLCD61(value)))
#define LCD_BWR_WF8B_BPBLCD61(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD61_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD37[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD37 field. */
#define LCD_RD_WF8B_BPBLCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD37_MASK) >> LCD_WF8B_BPBLCD37_SHIFT)
#define LCD_BRD_WF8B_BPBLCD37(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD37_SHIFT))

/*! @brief Set the BPBLCD37 field to a new value. */
#define LCD_WR_WF8B_BPBLCD37(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD37_MASK, LCD_WF8B_BPBLCD37(value)))
#define LCD_BWR_WF8B_BPBLCD37(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD37_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD31[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD31 field. */
#define LCD_RD_WF8B_BPBLCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD31_MASK) >> LCD_WF8B_BPBLCD31_SHIFT)
#define LCD_BRD_WF8B_BPBLCD31(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD31_SHIFT))

/*! @brief Set the BPBLCD31 field to a new value. */
#define LCD_WR_WF8B_BPBLCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD31_MASK, LCD_WF8B_BPBLCD31(value)))
#define LCD_BWR_WF8B_BPBLCD31(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD31_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD58[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD58 field. */
#define LCD_RD_WF8B_BPBLCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD58_MASK) >> LCD_WF8B_BPBLCD58_SHIFT)
#define LCD_BRD_WF8B_BPBLCD58(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD58_SHIFT))

/*! @brief Set the BPBLCD58 field to a new value. */
#define LCD_WR_WF8B_BPBLCD58(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD58_MASK, LCD_WF8B_BPBLCD58(value)))
#define LCD_BWR_WF8B_BPBLCD58(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD58_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD18[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD18 field. */
#define LCD_RD_WF8B_BPBLCD18(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD18_MASK) >> LCD_WF8B_BPBLCD18_SHIFT)
#define LCD_BRD_WF8B_BPBLCD18(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD18_SHIFT))

/*! @brief Set the BPBLCD18 field to a new value. */
#define LCD_WR_WF8B_BPBLCD18(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD18_MASK, LCD_WF8B_BPBLCD18(value)))
#define LCD_BWR_WF8B_BPBLCD18(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD18_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD45[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD45 field. */
#define LCD_RD_WF8B_BPBLCD45(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD45_MASK) >> LCD_WF8B_BPBLCD45_SHIFT)
#define LCD_BRD_WF8B_BPBLCD45(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD45_SHIFT))

/*! @brief Set the BPBLCD45 field to a new value. */
#define LCD_WR_WF8B_BPBLCD45(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD45_MASK, LCD_WF8B_BPBLCD45(value)))
#define LCD_BWR_WF8B_BPBLCD45(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD45_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD27[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD27 field. */
#define LCD_RD_WF8B_BPBLCD27(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD27_MASK) >> LCD_WF8B_BPBLCD27_SHIFT)
#define LCD_BRD_WF8B_BPBLCD27(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD27_SHIFT))

/*! @brief Set the BPBLCD27 field to a new value. */
#define LCD_WR_WF8B_BPBLCD27(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD27_MASK, LCD_WF8B_BPBLCD27(value)))
#define LCD_BWR_WF8B_BPBLCD27(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD14[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD14 field. */
#define LCD_RD_WF8B_BPBLCD14(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD14_MASK) >> LCD_WF8B_BPBLCD14_SHIFT)
#define LCD_BRD_WF8B_BPBLCD14(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD14_SHIFT))

/*! @brief Set the BPBLCD14 field to a new value. */
#define LCD_WR_WF8B_BPBLCD14(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD14_MASK, LCD_WF8B_BPBLCD14(value)))
#define LCD_BWR_WF8B_BPBLCD14(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD51[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD51 field. */
#define LCD_RD_WF8B_BPBLCD51(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD51_MASK) >> LCD_WF8B_BPBLCD51_SHIFT)
#define LCD_BRD_WF8B_BPBLCD51(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD51_SHIFT))

/*! @brief Set the BPBLCD51 field to a new value. */
#define LCD_WR_WF8B_BPBLCD51(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD51_MASK, LCD_WF8B_BPBLCD51(value)))
#define LCD_BWR_WF8B_BPBLCD51(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD51_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD52[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD52 field. */
#define LCD_RD_WF8B_BPBLCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD52_MASK) >> LCD_WF8B_BPBLCD52_SHIFT)
#define LCD_BRD_WF8B_BPBLCD52(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD52_SHIFT))

/*! @brief Set the BPBLCD52 field to a new value. */
#define LCD_WR_WF8B_BPBLCD52(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD52_MASK, LCD_WF8B_BPBLCD52(value)))
#define LCD_BWR_WF8B_BPBLCD52(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD52_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD4[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD4 field. */
#define LCD_RD_WF8B_BPBLCD4(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD4_MASK) >> LCD_WF8B_BPBLCD4_SHIFT)
#define LCD_BRD_WF8B_BPBLCD4(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD4_SHIFT))

/*! @brief Set the BPBLCD4 field to a new value. */
#define LCD_WR_WF8B_BPBLCD4(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD4_MASK, LCD_WF8B_BPBLCD4(value)))
#define LCD_BWR_WF8B_BPBLCD4(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD35[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD35 field. */
#define LCD_RD_WF8B_BPBLCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD35_MASK) >> LCD_WF8B_BPBLCD35_SHIFT)
#define LCD_BRD_WF8B_BPBLCD35(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD35_SHIFT))

/*! @brief Set the BPBLCD35 field to a new value. */
#define LCD_WR_WF8B_BPBLCD35(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD35_MASK, LCD_WF8B_BPBLCD35(value)))
#define LCD_BWR_WF8B_BPBLCD35(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD35_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD17[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD17 field. */
#define LCD_RD_WF8B_BPBLCD17(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD17_MASK) >> LCD_WF8B_BPBLCD17_SHIFT)
#define LCD_BRD_WF8B_BPBLCD17(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD17_SHIFT))

/*! @brief Set the BPBLCD17 field to a new value. */
#define LCD_WR_WF8B_BPBLCD17(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD17_MASK, LCD_WF8B_BPBLCD17(value)))
#define LCD_BWR_WF8B_BPBLCD17(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD17_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD41[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD41 field. */
#define LCD_RD_WF8B_BPBLCD41(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD41_MASK) >> LCD_WF8B_BPBLCD41_SHIFT)
#define LCD_BRD_WF8B_BPBLCD41(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD41_SHIFT))

/*! @brief Set the BPBLCD41 field to a new value. */
#define LCD_WR_WF8B_BPBLCD41(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD41_MASK, LCD_WF8B_BPBLCD41(value)))
#define LCD_BWR_WF8B_BPBLCD41(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD41_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD11[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD11 field. */
#define LCD_RD_WF8B_BPBLCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD11_MASK) >> LCD_WF8B_BPBLCD11_SHIFT)
#define LCD_BRD_WF8B_BPBLCD11(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD11_SHIFT))

/*! @brief Set the BPBLCD11 field to a new value. */
#define LCD_WR_WF8B_BPBLCD11(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD11_MASK, LCD_WF8B_BPBLCD11(value)))
#define LCD_BWR_WF8B_BPBLCD11(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD46[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD46 field. */
#define LCD_RD_WF8B_BPBLCD46(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD46_MASK) >> LCD_WF8B_BPBLCD46_SHIFT)
#define LCD_BRD_WF8B_BPBLCD46(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD46_SHIFT))

/*! @brief Set the BPBLCD46 field to a new value. */
#define LCD_WR_WF8B_BPBLCD46(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD46_MASK, LCD_WF8B_BPBLCD46(value)))
#define LCD_BWR_WF8B_BPBLCD46(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD46_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD57[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD57 field. */
#define LCD_RD_WF8B_BPBLCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD57_MASK) >> LCD_WF8B_BPBLCD57_SHIFT)
#define LCD_BRD_WF8B_BPBLCD57(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD57_SHIFT))

/*! @brief Set the BPBLCD57 field to a new value. */
#define LCD_WR_WF8B_BPBLCD57(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD57_MASK, LCD_WF8B_BPBLCD57(value)))
#define LCD_BWR_WF8B_BPBLCD57(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD57_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD42[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD42 field. */
#define LCD_RD_WF8B_BPBLCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD42_MASK) >> LCD_WF8B_BPBLCD42_SHIFT)
#define LCD_BRD_WF8B_BPBLCD42(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD42_SHIFT))

/*! @brief Set the BPBLCD42 field to a new value. */
#define LCD_WR_WF8B_BPBLCD42(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD42_MASK, LCD_WF8B_BPBLCD42(value)))
#define LCD_BWR_WF8B_BPBLCD42(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD42_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD5[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD5 field. */
#define LCD_RD_WF8B_BPBLCD5(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD5_MASK) >> LCD_WF8B_BPBLCD5_SHIFT)
#define LCD_BRD_WF8B_BPBLCD5(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD5_SHIFT))

/*! @brief Set the BPBLCD5 field to a new value. */
#define LCD_WR_WF8B_BPBLCD5(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD5_MASK, LCD_WF8B_BPBLCD5(value)))
#define LCD_BWR_WF8B_BPBLCD5(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD3[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD3 field. */
#define LCD_RD_WF8B_BPBLCD3(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD3_MASK) >> LCD_WF8B_BPBLCD3_SHIFT)
#define LCD_BRD_WF8B_BPBLCD3(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD3_SHIFT))

