RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*! @brief Set the BPCLCD32 field to a new value. */
#define LCD_WR_WF8B_BPCLCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD32_MASK, LCD_WF8B_BPCLCD32(value)))
#define LCD_BWR_WF8B_BPCLCD32(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD32_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD28[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD28 field. */
#define LCD_RD_WF8B_BPCLCD28(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD28_MASK) >> LCD_WF8B_BPCLCD28_SHIFT)
#define LCD_BRD_WF8B_BPCLCD28(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD28_SHIFT))

/*! @brief Set the BPCLCD28 field to a new value. */
#define LCD_WR_WF8B_BPCLCD28(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD28_MASK, LCD_WF8B_BPCLCD28(value)))
#define LCD_BWR_WF8B_BPCLCD28(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD53[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD53 field. */
#define LCD_RD_WF8B_BPCLCD53(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD53_MASK) >> LCD_WF8B_BPCLCD53_SHIFT)
#define LCD_BRD_WF8B_BPCLCD53(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD53_SHIFT))

/*! @brief Set the BPCLCD53 field to a new value. */
#define LCD_WR_WF8B_BPCLCD53(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD53_MASK, LCD_WF8B_BPCLCD53(value)))
#define LCD_BWR_WF8B_BPCLCD53(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD53_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD33[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD33 field. */
#define LCD_RD_WF8B_BPCLCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD33_MASK) >> LCD_WF8B_BPCLCD33_SHIFT)
#define LCD_BRD_WF8B_BPCLCD33(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD33_SHIFT))

/*! @brief Set the BPCLCD33 field to a new value. */
#define LCD_WR_WF8B_BPCLCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD33_MASK, LCD_WF8B_BPCLCD33(value)))
#define LCD_BWR_WF8B_BPCLCD33(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD33_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD0[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD0 field. */
#define LCD_RD_WF8B_BPCLCD0(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD0_MASK) >> LCD_WF8B_BPCLCD0_SHIFT)
#define LCD_BRD_WF8B_BPCLCD0(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD0_SHIFT))

/*! @brief Set the BPCLCD0 field to a new value. */
#define LCD_WR_WF8B_BPCLCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD0_MASK, LCD_WF8B_BPCLCD0(value)))
#define LCD_BWR_WF8B_BPCLCD0(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD43[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD43 field. */
#define LCD_RD_WF8B_BPCLCD43(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD43_MASK) >> LCD_WF8B_BPCLCD43_SHIFT)
#define LCD_BRD_WF8B_BPCLCD43(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD43_SHIFT))

/*! @brief Set the BPCLCD43 field to a new value. */
#define LCD_WR_WF8B_BPCLCD43(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD43_MASK, LCD_WF8B_BPCLCD43(value)))
#define LCD_BWR_WF8B_BPCLCD43(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD43_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD7[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD7 field. */
#define LCD_RD_WF8B_BPCLCD7(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD7_MASK) >> LCD_WF8B_BPCLCD7_SHIFT)
#define LCD_BRD_WF8B_BPCLCD7(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD7_SHIFT))

/*! @brief Set the BPCLCD7 field to a new value. */
#define LCD_WR_WF8B_BPCLCD7(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD7_MASK, LCD_WF8B_BPCLCD7(value)))
#define LCD_BWR_WF8B_BPCLCD7(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD4[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD4 field. */
#define LCD_RD_WF8B_BPCLCD4(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD4_MASK) >> LCD_WF8B_BPCLCD4_SHIFT)
#define LCD_BRD_WF8B_BPCLCD4(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD4_SHIFT))

/*! @brief Set the BPCLCD4 field to a new value. */
#define LCD_WR_WF8B_BPCLCD4(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD4_MASK, LCD_WF8B_BPCLCD4(value)))
#define LCD_BWR_WF8B_BPCLCD4(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD34[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD34 field. */
#define LCD_RD_WF8B_BPCLCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD34_MASK) >> LCD_WF8B_BPCLCD34_SHIFT)
#define LCD_BRD_WF8B_BPCLCD34(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD34_SHIFT))

/*! @brief Set the BPCLCD34 field to a new value. */
#define LCD_WR_WF8B_BPCLCD34(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD34_MASK, LCD_WF8B_BPCLCD34(value)))
#define LCD_BWR_WF8B_BPCLCD34(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD34_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD29[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD29 field. */
#define LCD_RD_WF8B_BPCLCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD29_MASK) >> LCD_WF8B_BPCLCD29_SHIFT)
#define LCD_BRD_WF8B_BPCLCD29(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD29_SHIFT))

/*! @brief Set the BPCLCD29 field to a new value. */
#define LCD_WR_WF8B_BPCLCD29(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD29_MASK, LCD_WF8B_BPCLCD29(value)))
#define LCD_BWR_WF8B_BPCLCD29(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD45[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD45 field. */
#define LCD_RD_WF8B_BPCLCD45(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD45_MASK) >> LCD_WF8B_BPCLCD45_SHIFT)
#define LCD_BRD_WF8B_BPCLCD45(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD45_SHIFT))

