RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*! @brief Set the BPFLCD43 field to a new value. */
#define LCD_WR_WF8B_BPFLCD43(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD43_MASK, LCD_WF8B_BPFLCD43(value)))
#define LCD_BWR_WF8B_BPFLCD43(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD43_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD5[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD5 field. */
#define LCD_RD_WF8B_BPFLCD5(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD5_MASK) >> LCD_WF8B_BPFLCD5_SHIFT)
#define LCD_BRD_WF8B_BPFLCD5(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD5_SHIFT))

/*! @brief Set the BPFLCD5 field to a new value. */
#define LCD_WR_WF8B_BPFLCD5(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD5_MASK, LCD_WF8B_BPFLCD5(value)))
#define LCD_BWR_WF8B_BPFLCD5(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD62[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD62 field. */
#define LCD_RD_WF8B_BPFLCD62(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD62_MASK) >> LCD_WF8B_BPFLCD62_SHIFT)
#define LCD_BRD_WF8B_BPFLCD62(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD62_SHIFT))

/*! @brief Set the BPFLCD62 field to a new value. */
#define LCD_WR_WF8B_BPFLCD62(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD62_MASK, LCD_WF8B_BPFLCD62(value)))
#define LCD_BWR_WF8B_BPFLCD62(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD62_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD14[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD14 field. */
#define LCD_RD_WF8B_BPFLCD14(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD14_MASK) >> LCD_WF8B_BPFLCD14_SHIFT)
#define LCD_BRD_WF8B_BPFLCD14(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD14_SHIFT))

/*! @brief Set the BPFLCD14 field to a new value. */
#define LCD_WR_WF8B_BPFLCD14(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD14_MASK, LCD_WF8B_BPFLCD14(value)))
#define LCD_BWR_WF8B_BPFLCD14(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD24[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD24 field. */
#define LCD_RD_WF8B_BPFLCD24(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD24_MASK) >> LCD_WF8B_BPFLCD24_SHIFT)
#define LCD_BRD_WF8B_BPFLCD24(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD24_SHIFT))

/*! @brief Set the BPFLCD24 field to a new value. */
#define LCD_WR_WF8B_BPFLCD24(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD24_MASK, LCD_WF8B_BPFLCD24(value)))
#define LCD_BWR_WF8B_BPFLCD24(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD24_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD54[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD54 field. */
#define LCD_RD_WF8B_BPFLCD54(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD54_MASK) >> LCD_WF8B_BPFLCD54_SHIFT)
#define LCD_BRD_WF8B_BPFLCD54(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD54_SHIFT))

/*! @brief Set the BPFLCD54 field to a new value. */
#define LCD_WR_WF8B_BPFLCD54(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD54_MASK, LCD_WF8B_BPFLCD54(value)))
#define LCD_BWR_WF8B_BPFLCD54(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD54_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD15[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD15 field. */
#define LCD_RD_WF8B_BPFLCD15(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD15_MASK) >> LCD_WF8B_BPFLCD15_SHIFT)
#define LCD_BRD_WF8B_BPFLCD15(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD15_SHIFT))

/*! @brief Set the BPFLCD15 field to a new value. */
#define LCD_WR_WF8B_BPFLCD15(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD15_MASK, LCD_WF8B_BPFLCD15(value)))
#define LCD_BWR_WF8B_BPFLCD15(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD15_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD32[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD32 field. */
#define LCD_RD_WF8B_BPFLCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD32_MASK) >> LCD_WF8B_BPFLCD32_SHIFT)
#define LCD_BRD_WF8B_BPFLCD32(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD32_SHIFT))

/*! @brief Set the BPFLCD32 field to a new value. */
#define LCD_WR_WF8B_BPFLCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD32_MASK, LCD_WF8B_BPFLCD32(value)))
#define LCD_BWR_WF8B_BPFLCD32(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD32_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD61[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD61 field. */
#define LCD_RD_WF8B_BPFLCD61(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD61_MASK) >> LCD_WF8B_BPFLCD61_SHIFT)
#define LCD_BRD_WF8B_BPFLCD61(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD61_SHIFT))

/*! @brief Set the BPFLCD61 field to a new value. */
#define LCD_WR_WF8B_BPFLCD61(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD61_MASK, LCD_WF8B_BPFLCD61(value)))
#define LCD_BWR_WF8B_BPFLCD61(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD61_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD25[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD25 field. */
#define LCD_RD_WF8B_BPFLCD25(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD25_MASK) >> LCD_WF8B_BPFLCD25_SHIFT)
#define LCD_BRD_WF8B_BPFLCD25(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD25_SHIFT))

/*! @brief Set the BPFLCD25 field to a new value. */
#define LCD_WR_WF8B_BPFLCD25(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD25_MASK, LCD_WF8B_BPFLCD25(value)))
#define LCD_BWR_WF8B_BPFLCD25(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD25_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD60[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD60 field. */
#define LCD_RD_WF8B_BPFLCD60(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD60_MASK) >> LCD_WF8B_BPFLCD60_SHIFT)
#define LCD_BRD_WF8B_BPFLCD60(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD60_SHIFT))

/*! @brief Set the BPFLCD60 field to a new value. */
#define LCD_WR_WF8B_BPFLCD60(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD60_MASK, LCD_WF8B_BPFLCD60(value)))
#define LCD_BWR_WF8B_BPFLCD60(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD60_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD41[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD41 field. */
#define LCD_RD_WF8B_BPFLCD41(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD41_MASK) >> LCD_WF8B_BPFLCD41_SHIFT)
#define LCD_BRD_WF8B_BPFLCD41(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD41_SHIFT))

/*! @brief Set the BPFLCD41 field to a new value. */
#define LCD_WR_WF8B_BPFLCD41(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD41_MASK, LCD_WF8B_BPFLCD41(value)))
#define LCD_BWR_WF8B_BPFLCD41(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD41_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD33[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD33 field. */
#define LCD_RD_WF8B_BPFLCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD33_MASK) >> LCD_WF8B_BPFLCD33_SHIFT)
#define LCD_BRD_WF8B_BPFLCD33(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD33_SHIFT))

/*! @brief Set the BPFLCD33 field to a new value. */
#define LCD_WR_WF8B_BPFLCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD33_MASK, LCD_WF8B_BPFLCD33(value)))
#define LCD_BWR_WF8B_BPFLCD33(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD33_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD53[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD53 field. */
#define LCD_RD_WF8B_BPFLCD53(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD53_MASK) >> LCD_WF8B_BPFLCD53_SHIFT)
#define LCD_BRD_WF8B_BPFLCD53(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD53_SHIFT))

/*! @brief Set the BPFLCD53 field to a new value. */
#define LCD_WR_WF8B_BPFLCD53(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD53_MASK, LCD_WF8B_BPFLCD53(value)))
#define LCD_BWR_WF8B_BPFLCD53(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD53_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD59[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD59 field. */
#define LCD_RD_WF8B_BPFLCD59(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD59_MASK) >> LCD_WF8B_BPFLCD59_SHIFT)
#define LCD_BRD_WF8B_BPFLCD59(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD59_SHIFT))

/*! @brief Set the BPFLCD59 field to a new value. */
#define LCD_WR_WF8B_BPFLCD59(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD59_MASK, LCD_WF8B_BPFLCD59(value)))
#define LCD_BWR_WF8B_BPFLCD59(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD59_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD0[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD0 field. */
#define LCD_RD_WF8B_BPFLCD0(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD0_MASK) >> LCD_WF8B_BPFLCD0_SHIFT)
#define LCD_BRD_WF8B_BPFLCD0(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD0_SHIFT))

