RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*! @brief Set the BPGLCD0 field to a new value. */
#define LCD_WR_WF8B_BPGLCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD0_MASK, LCD_WF8B_BPGLCD0(value)))
#define LCD_BWR_WF8B_BPGLCD0(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD57[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD57 field. */
#define LCD_RD_WF8B_BPGLCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD57_MASK) >> LCD_WF8B_BPGLCD57_SHIFT)
#define LCD_BRD_WF8B_BPGLCD57(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD57_SHIFT))

/*! @brief Set the BPGLCD57 field to a new value. */
#define LCD_WR_WF8B_BPGLCD57(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD57_MASK, LCD_WF8B_BPGLCD57(value)))
#define LCD_BWR_WF8B_BPGLCD57(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD57_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD52[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD52 field. */
#define LCD_RD_WF8B_BPGLCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD52_MASK) >> LCD_WF8B_BPGLCD52_SHIFT)
#define LCD_BRD_WF8B_BPGLCD52(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD52_SHIFT))

/*! @brief Set the BPGLCD52 field to a new value. */
#define LCD_WR_WF8B_BPGLCD52(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD52_MASK, LCD_WF8B_BPGLCD52(value)))
#define LCD_BWR_WF8B_BPGLCD52(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD52_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD7[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD7 field. */
#define LCD_RD_WF8B_BPGLCD7(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD7_MASK) >> LCD_WF8B_BPGLCD7_SHIFT)
#define LCD_BRD_WF8B_BPGLCD7(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD7_SHIFT))

/*! @brief Set the BPGLCD7 field to a new value. */
#define LCD_WR_WF8B_BPGLCD7(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD7_MASK, LCD_WF8B_BPGLCD7(value)))
#define LCD_BWR_WF8B_BPGLCD7(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD56[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD56 field. */
#define LCD_RD_WF8B_BPGLCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD56_MASK) >> LCD_WF8B_BPGLCD56_SHIFT)
#define LCD_BRD_WF8B_BPGLCD56(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD56_SHIFT))

/*! @brief Set the BPGLCD56 field to a new value. */
#define LCD_WR_WF8B_BPGLCD56(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD56_MASK, LCD_WF8B_BPGLCD56(value)))
#define LCD_BWR_WF8B_BPGLCD56(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD56_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD6[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD6 field. */
#define LCD_RD_WF8B_BPGLCD6(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD6_MASK) >> LCD_WF8B_BPGLCD6_SHIFT)
#define LCD_BRD_WF8B_BPGLCD6(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD6_SHIFT))

/*! @brief Set the BPGLCD6 field to a new value. */
#define LCD_WR_WF8B_BPGLCD6(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD6_MASK, LCD_WF8B_BPGLCD6(value)))
#define LCD_BWR_WF8B_BPGLCD6(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD51[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD51 field. */
#define LCD_RD_WF8B_BPGLCD51(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD51_MASK) >> LCD_WF8B_BPGLCD51_SHIFT)
#define LCD_BRD_WF8B_BPGLCD51(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD51_SHIFT))

/*! @brief Set the BPGLCD51 field to a new value. */
#define LCD_WR_WF8B_BPGLCD51(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD51_MASK, LCD_WF8B_BPGLCD51(value)))
#define LCD_BWR_WF8B_BPGLCD51(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD51_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD16[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD16 field. */
#define LCD_RD_WF8B_BPGLCD16(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD16_MASK) >> LCD_WF8B_BPGLCD16_SHIFT)
#define LCD_BRD_WF8B_BPGLCD16(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD16_SHIFT))

/*! @brief Set the BPGLCD16 field to a new value. */
#define LCD_WR_WF8B_BPGLCD16(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD16_MASK, LCD_WF8B_BPGLCD16(value)))
#define LCD_BWR_WF8B_BPGLCD16(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD16_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD1[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD1 field. */
#define LCD_RD_WF8B_BPGLCD1(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD1_MASK) >> LCD_WF8B_BPGLCD1_SHIFT)
#define LCD_BRD_WF8B_BPGLCD1(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD1_SHIFT))

/*! @brief Set the BPGLCD1 field to a new value. */
#define LCD_WR_WF8B_BPGLCD1(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD1_MASK, LCD_WF8B_BPGLCD1(value)))
#define LCD_BWR_WF8B_BPGLCD1(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD17[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD17 field. */
#define LCD_RD_WF8B_BPGLCD17(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD17_MASK) >> LCD_WF8B_BPGLCD17_SHIFT)
#define LCD_BRD_WF8B_BPGLCD17(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD17_SHIFT))

/*! @brief Set the BPGLCD17 field to a new value. */
#define LCD_WR_WF8B_BPGLCD17(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD17_MASK, LCD_WF8B_BPGLCD17(value)))
#define LCD_BWR_WF8B_BPGLCD17(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD17_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD50[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD50 field. */
#define LCD_RD_WF8B_BPGLCD50(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD50_MASK) >> LCD_WF8B_BPGLCD50_SHIFT)
#define LCD_BRD_WF8B_BPGLCD50(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD50_SHIFT))

