RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * TRIAMP_C0 - Control Register 0
 ******************************************************************************/

/*!
 * @brief TRIAMP_C0 - Control Register 0 (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire TRIAMP_C0 register
 */
/*@{*/
#define TRIAMP_RD_C0(base)       (TRIAMP_C0_REG(base))
#define TRIAMP_WR_C0(base, value) (TRIAMP_C0_REG(base) = (value))
#define TRIAMP_RMW_C0(base, mask, value) (TRIAMP_WR_C0(base, (TRIAMP_RD_C0(base) & ~(mask)) | (value)))
#define TRIAMP_SET_C0(base, value) (TRIAMP_WR_C0(base, TRIAMP_RD_C0(base) |  (value)))
#define TRIAMP_CLR_C0(base, value) (TRIAMP_WR_C0(base, TRIAMP_RD_C0(base) & ~(value)))
#define TRIAMP_TOG_C0(base, value) (TRIAMP_WR_C0(base, TRIAMP_RD_C0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRIAMP_C0 bitfields
 */

/*!
 * @name Register TRIAMP_C0, field LPEN[6] (RW)
 *
 * LPEN is the power level control field. See the TRIAMP electrical
 * specifications in the device data sheet for details on the impact of the modes below.
 *
 * Values:
 * - 0b0 - High-speed mode selected. In this mode, TRIAMP has faster slew rate
 *     and unity gain bandwidth performance with higher current consumption.
 * - 0b1 - Low-power mode selected. In this mode, TRIAMP has lower current
 *     consumption with slower slew rate and unity gain bandwidth performance.
 */
/*@{*/
/*! @brief Read current value of the TRIAMP_C0_LPEN field. */
#define TRIAMP_RD_C0_LPEN(base) ((TRIAMP_C0_REG(base) & TRIAMP_C0_LPEN_MASK) >> TRIAMP_C0_LPEN_SHIFT)
#define TRIAMP_BRD_C0_LPEN(base) (BITBAND_ACCESS8(&TRIAMP_C0_REG(base), TRIAMP_C0_LPEN_SHIFT))

/*! @brief Set the LPEN field to a new value. */
#define TRIAMP_WR_C0_LPEN(base, value) (TRIAMP_RMW_C0(base, TRIAMP_C0_LPEN_MASK, TRIAMP_C0_LPEN(value)))
#define TRIAMP_BWR_C0_LPEN(base, value) (BITBAND_ACCESS8(&TRIAMP_C0_REG(base), TRIAMP_C0_LPEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TRIAMP_C0, field TRIAMPEN[7] (RW)
 *
 * Values:
 * - 0b0 - The amplifier is disabled and not powered.
 * - 0b1 - TRIAMP system is enabled. In this mode, the amplifier is powered and
 *     enabled.
 */
/*@{*/
/*! @brief Read current value of the TRIAMP_C0_TRIAMPEN field. */
#define TRIAMP_RD_C0_TRIAMPEN(base) ((TRIAMP_C0_REG(base) & TRIAMP_C0_TRIAMPEN_MASK) >> TRIAMP_C0_TRIAMPEN_SHIFT)
#define TRIAMP_BRD_C0_TRIAMPEN(base) (BITBAND_ACCESS8(&TRIAMP_C0_REG(base), TRIAMP_C0_TRIAMPEN_SHIFT))

/*! @brief Set the TRIAMPEN field to a new value. */
#define TRIAMP_WR_C0_TRIAMPEN(base, value) (TRIAMP_RMW_C0(base, TRIAMP_C0_TRIAMPEN_MASK, TRIAMP_C0_TRIAMPEN(value)))
#define TRIAMP_BWR_C0_TRIAMPEN(base, value) (BITBAND_ACCESS8(&TRIAMP_C0_REG(base), TRIAMP_C0_TRIAMPEN_SHIFT) = (value))
/*@}*/

/*
 * MK53D10 TSI
 *
 * Touch Sensing Input
 *
 * Registers defined in this header file:
 * - TSI_GENCS - General Control and Status register
 * - TSI_SCANC - SCAN Control register
 * - TSI_PEN - Pin Enable register
 * - TSI_WUCNTR - Wake-Up Channel Counter Register
 * - TSI_CNTR1 - Counter Register
 * - TSI_CNTR3 - Counter Register
 * - TSI_CNTR5 - Counter Register
 * - TSI_CNTR7 - Counter Register
 * - TSI_CNTR9 - Counter Register
 * - TSI_CNTR11 - Counter Register
 * - TSI_CNTR13 - Counter Register
 * - TSI_CNTR15 - Counter Register
 * - TSI_THRESHOLD - Low-Power Channel Threshold register
 */

#define TSI_INSTANCE_COUNT (1U) /*!< Number of instances of the TSI module. */
#define TSI0_IDX (0U) /*!< Instance number for TSI0. */

/*******************************************************************************
 * TSI_GENCS - General Control and Status register
 ******************************************************************************/

/*!
 * @brief TSI_GENCS - General Control and Status register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_GENCS register
 */
/*@{*/
#define TSI_RD_GENCS(base)       (TSI_GENCS_REG(base))
#define TSI_WR_GENCS(base, value) (TSI_GENCS_REG(base) = (value))
#define TSI_RMW_GENCS(base, mask, value) (TSI_WR_GENCS(base, (TSI_RD_GENCS(base) & ~(mask)) | (value)))
#define TSI_SET_GENCS(base, value) (TSI_WR_GENCS(base, TSI_RD_GENCS(base) |  (value)))
#define TSI_CLR_GENCS(base, value) (TSI_WR_GENCS(base, TSI_RD_GENCS(base) & ~(value)))
#define TSI_TOG_GENCS(base, value) (TSI_WR_GENCS(base, TSI_RD_GENCS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TSI_GENCS bitfields
 */

/*!
 * @name Register TSI_GENCS, field STPE[0] (RW)
 *
 * TSI STOP Enable while in low-power modes (STOP, VLPS, LLS, and VLLS{3,2,1}).
 *
 * Values:
 * - 0b0 - Disable TSI when MCU goes into low-power modes.
 * - 0b1 - Allows TSI to continue running in all low-power modes.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_STPE field. */
#define TSI_RD_GENCS_STPE(base) ((TSI_GENCS_REG(base) & TSI_GENCS_STPE_MASK) >> TSI_GENCS_STPE_SHIFT)
#define TSI_BRD_GENCS_STPE(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_STPE_SHIFT))

/*! @brief Set the STPE field to a new value. */
#define TSI_WR_GENCS_STPE(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_STPE_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_STPE(value)))
#define TSI_BWR_GENCS_STPE(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_STPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field STM[1] (RW)
 *
 * This field can be changed only if the TSI module is disabled (TSIEN bit = 0).
 *
 * Values:
 * - 0b0 - Software trigger scan.
 * - 0b1 - Periodical Scan.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_STM field. */
#define TSI_RD_GENCS_STM(base) ((TSI_GENCS_REG(base) & TSI_GENCS_STM_MASK) >> TSI_GENCS_STM_SHIFT)
#define TSI_BRD_GENCS_STM(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_STM_SHIFT))

/*! @brief Set the STM field to a new value. */
#define TSI_WR_GENCS_STM(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_STM_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_STM(value)))
#define TSI_BWR_GENCS_STM(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_STM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field ESOR[4] (RW)
 *
 * Values:
 * - 0b0 - Out-of-Range interrupt is allowed.
 * - 0b1 - End-of-Scan interrupt is allowed.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_ESOR field. */
#define TSI_RD_GENCS_ESOR(base) ((TSI_GENCS_REG(base) & TSI_GENCS_ESOR_MASK) >> TSI_GENCS_ESOR_SHIFT)
#define TSI_BRD_GENCS_ESOR(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_ESOR_SHIFT))

/*! @brief Set the ESOR field to a new value. */
#define TSI_WR_GENCS_ESOR(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_ESOR_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_ESOR(value)))
#define TSI_BWR_GENCS_ESOR(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_ESOR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field ERIE[5] (RW)
 *
 * Caused either by a Short or Overrun Error.
 *
 * Values:
 * - 0b0 - Interrupt disabled for error.
 * - 0b1 - Interrupt enabled for error.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_ERIE field. */
#define TSI_RD_GENCS_ERIE(base) ((TSI_GENCS_REG(base) & TSI_GENCS_ERIE_MASK) >> TSI_GENCS_ERIE_SHIFT)
#define TSI_BRD_GENCS_ERIE(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_ERIE_SHIFT))

/*! @brief Set the ERIE field to a new value. */
#define TSI_WR_GENCS_ERIE(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_ERIE_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_ERIE(value)))
#define TSI_BWR_GENCS_ERIE(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_ERIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field TSIIE[6] (RW)
 *
 * Values:
 * - 0b0 - Interrupt from TSI is disabled.
 * - 0b1 - Interrupt from TSI is enabled.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_TSIIE field. */
#define TSI_RD_GENCS_TSIIE(base) ((TSI_GENCS_REG(base) & TSI_GENCS_TSIIE_MASK) >> TSI_GENCS_TSIIE_SHIFT)
#define TSI_BRD_GENCS_TSIIE(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_TSIIE_SHIFT))

/*! @brief Set the TSIIE field to a new value. */
#define TSI_WR_GENCS_TSIIE(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_TSIIE_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_TSIIE(value)))
#define TSI_BWR_GENCS_TSIIE(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_TSIIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field TSIEN[7] (RW)
 *
 * Values:
 * - 0b0 - TSI module is disabled.
 * - 0b1 - TSI module is enabled.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_TSIEN field. */
#define TSI_RD_GENCS_TSIEN(base) ((TSI_GENCS_REG(base) & TSI_GENCS_TSIEN_MASK) >> TSI_GENCS_TSIEN_SHIFT)
#define TSI_BRD_GENCS_TSIEN(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_TSIEN_SHIFT))

