RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * TSI_CNTR15 - Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_CNTR15 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_CNTR15 register
 */
/*@{*/
#define TSI_RD_CNTR15(base)      (TSI_CNTR15_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR15 bitfields
 */

/*!
 * @name Register TSI_CNTR15, field CTN1[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR15_CTN1 field. */
#define TSI_RD_CNTR15_CTN1(base) ((TSI_CNTR15_REG(base) & TSI_CNTR15_CTN1_MASK) >> TSI_CNTR15_CTN1_SHIFT)
#define TSI_BRD_CNTR15_CTN1(base) (TSI_RD_CNTR15_CTN1(base))
/*@}*/

/*!
 * @name Register TSI_CNTR15, field CTN[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR15_CTN field. */
#define TSI_RD_CNTR15_CTN(base) ((TSI_CNTR15_REG(base) & TSI_CNTR15_CTN_MASK) >> TSI_CNTR15_CTN_SHIFT)
#define TSI_BRD_CNTR15_CTN(base) (TSI_RD_CNTR15_CTN(base))
/*@}*/

/*******************************************************************************
 * TSI_THRESHOLD - Low-Power Channel Threshold register
 ******************************************************************************/

/*!
 * @brief TSI_THRESHOLD - Low-Power Channel Threshold register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_THRESHOLD register
 */
/*@{*/
#define TSI_RD_THRESHOLD(base)   (TSI_THRESHOLD_REG(base))
#define TSI_WR_THRESHOLD(base, value) (TSI_THRESHOLD_REG(base) = (value))
#define TSI_RMW_THRESHOLD(base, mask, value) (TSI_WR_THRESHOLD(base, (TSI_RD_THRESHOLD(base) & ~(mask)) | (value)))
#define TSI_SET_THRESHOLD(base, value) (TSI_WR_THRESHOLD(base, TSI_RD_THRESHOLD(base) |  (value)))
#define TSI_CLR_THRESHOLD(base, value) (TSI_WR_THRESHOLD(base, TSI_RD_THRESHOLD(base) & ~(value)))
#define TSI_TOG_THRESHOLD(base, value) (TSI_WR_THRESHOLD(base, TSI_RD_THRESHOLD(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TSI_THRESHOLD bitfields
 */

/*!
 * @name Register TSI_THRESHOLD, field HTHH[15:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the TSI_THRESHOLD_HTHH field. */
#define TSI_RD_THRESHOLD_HTHH(base) ((TSI_THRESHOLD_REG(base) & TSI_THRESHOLD_HTHH_MASK) >> TSI_THRESHOLD_HTHH_SHIFT)
#define TSI_BRD_THRESHOLD_HTHH(base) (TSI_RD_THRESHOLD_HTHH(base))

/*! @brief Set the HTHH field to a new value. */
#define TSI_WR_THRESHOLD_HTHH(base, value) (TSI_RMW_THRESHOLD(base, TSI_THRESHOLD_HTHH_MASK, TSI_THRESHOLD_HTHH(value)))
#define TSI_BWR_THRESHOLD_HTHH(base, value) (TSI_WR_THRESHOLD_HTHH(base, value))
/*@}*/

/*!
 * @name Register TSI_THRESHOLD, field LTHH[31:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the TSI_THRESHOLD_LTHH field. */
#define TSI_RD_THRESHOLD_LTHH(base) ((TSI_THRESHOLD_REG(base) & TSI_THRESHOLD_LTHH_MASK) >> TSI_THRESHOLD_LTHH_SHIFT)
#define TSI_BRD_THRESHOLD_LTHH(base) (TSI_RD_THRESHOLD_LTHH(base))

/*! @brief Set the LTHH field to a new value. */
#define TSI_WR_THRESHOLD_LTHH(base, value) (TSI_RMW_THRESHOLD(base, TSI_THRESHOLD_LTHH_MASK, TSI_THRESHOLD_LTHH(value)))
#define TSI_BWR_THRESHOLD_LTHH(base, value) (TSI_WR_THRESHOLD_LTHH(base, value))
/*@}*/

/*
 * MK53D10 UART
 *
 * Serial Communication Interface
 *
 * Registers defined in this header file:
 * - UART_BDH - UART Baud Rate Registers: High
 * - UART_BDL - UART Baud Rate Registers: Low
 * - UART_C1 - UART Control Register 1
 * - UART_C2 - UART Control Register 2
 * - UART_S1 - UART Status Register 1
 * - UART_S2 - UART Status Register 2
 * - UART_C3 - UART Control Register 3
 * - UART_D - UART Data Register
 * - UART_MA1 - UART Match Address Registers 1
 * - UART_MA2 - UART Match Address Registers 2
 * - UART_C4 - UART Control Register 4
 * - UART_C5 - UART Control Register 5
 * - UART_ED - UART Extended Data Register
 * - UART_MODEM - UART Modem Register
 * - UART_IR - UART Infrared Register
 * - UART_PFIFO - UART FIFO Parameters
 * - UART_CFIFO - UART FIFO Control Register
 * - UART_SFIFO - UART FIFO Status Register
 * - UART_TWFIFO - UART FIFO Transmit Watermark
 * - UART_TCFIFO - UART FIFO Transmit Count
 * - UART_RWFIFO - UART FIFO Receive Watermark
 * - UART_RCFIFO - UART FIFO Receive Count
 * - UART_C7816 - UART 7816 Control Register
 * - UART_IE7816 - UART 7816 Interrupt Enable Register
 * - UART_IS7816 - UART 7816 Interrupt Status Register
 * - UART_WP7816T0 - UART 7816 Wait Parameter Register
 * - UART_WP7816T1 - UART 7816 Wait Parameter Register
 * - UART_WN7816 - UART 7816 Wait N Register
 * - UART_WF7816 - UART 7816 Wait FD Register
 * - UART_ET7816 - UART 7816 Error Threshold Register
 * - UART_TL7816 - UART 7816 Transmit Length Register
 * - UART_C6 - UART CEA709.1-B Control Register 6
 * - UART_PCTH - UART CEA709.1-B Packet Cycle Time Counter High
 * - UART_PCTL - UART CEA709.1-B Packet Cycle Time Counter Low
 * - UART_B1T - UART CEA709.1-B Beta1 Timer
 * - UART_SDTH - UART CEA709.1-B Secondary Delay Timer High
 * - UART_SDTL - UART CEA709.1-B Secondary Delay Timer Low
 * - UART_PRE - UART CEA709.1-B Preamble
 * - UART_TPL - UART CEA709.1-B Transmit Packet Length
 * - UART_IE - UART CEA709.1-B Interrupt Enable Register
 * - UART_WB - UART CEA709.1-B WBASE
 * - UART_S3 - UART CEA709.1-B Status Register
 * - UART_S4 - UART CEA709.1-B Status Register
 * - UART_RPL - UART CEA709.1-B Received Packet Length
 * - UART_RPREL - UART CEA709.1-B Received Preamble Length
 * - UART_CPW - UART CEA709.1-B Collision Pulse Width
 * - UART_RIDT - UART CEA709.1-B Receive Indeterminate Time
 * - UART_TIDT - UART CEA709.1-B Transmit Indeterminate Time
 */

#define UART_INSTANCE_COUNT (6U) /*!< Number of instances of the UART module. */
#define UART0_IDX (0U) /*!< Instance number for UART0. */
#define UART1_IDX (1U) /*!< Instance number for UART1. */
#define UART2_IDX (2U) /*!< Instance number for UART2. */
#define UART3_IDX (3U) /*!< Instance number for UART3. */
#define UART4_IDX (4U) /*!< Instance number for UART4. */
#define UART5_IDX (5U) /*!< Instance number for UART5. */

