RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * UART_WB - UART CEA709.1-B WBASE
 ******************************************************************************/

/*!
 * @brief UART_WB - UART CEA709.1-B WBASE (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_WB register
 */
/*@{*/
#define UART_RD_WB(base)         (UART_WB_REG(base))
#define UART_WR_WB(base, value)  (UART_WB_REG(base) = (value))
#define UART_RMW_WB(base, mask, value) (UART_WR_WB(base, (UART_RD_WB(base) & ~(mask)) | (value)))
#define UART_SET_WB(base, value) (UART_WR_WB(base, UART_RD_WB(base) |  (value)))
#define UART_CLR_WB(base, value) (UART_WR_WB(base, UART_RD_WB(base) & ~(value)))
#define UART_TOG_WB(base, value) (UART_WR_WB(base, UART_RD_WB(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * UART_S3 - UART CEA709.1-B Status Register
 ******************************************************************************/

/*!
 * @brief UART_S3 - UART CEA709.1-B Status Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_S3 register
 */
/*@{*/
#define UART_RD_S3(base)         (UART_S3_REG(base))
#define UART_WR_S3(base, value)  (UART_S3_REG(base) = (value))
#define UART_RMW_S3(base, mask, value) (UART_WR_S3(base, (UART_RD_S3(base) & ~(mask)) | (value)))
#define UART_SET_S3(base, value) (UART_WR_S3(base, UART_RD_S3(base) |  (value)))
#define UART_CLR_S3(base, value) (UART_WR_S3(base, UART_RD_S3(base) & ~(value)))
#define UART_TOG_S3(base, value) (UART_WR_S3(base, UART_RD_S3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual UART_S3 bitfields
 */

/*!
 * @name Register UART_S3, field TXFF[0] (RW)
 *
 * Indicates that transmission could not proceed. This flag is asserted when the
 * packet is queued for transmission but before the random delay has expired and
 * an incoming receive packet is detected. This flag is also asserted while
 * transmission when the TX FIFO becomes empty or overflows. In these cases, line
 * code violation is transmitted on TX line immediately after the current byte or
 * preamble transmission is finished, without waiting for completion of transmit
 * packet length. If the transmission fail flag is asserted, C6[TX709] is cleared.
 * This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - Transmission continues normally.
 * - 0b1 - Transmission has failed.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_TXFF field. */
#define UART_RD_S3_TXFF(base) ((UART_S3_REG(base) & UART_S3_TXFF_MASK) >> UART_S3_TXFF_SHIFT)
#define UART_BRD_S3_TXFF(base) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_TXFF_SHIFT))

/*! @brief Set the TXFF field to a new value. */
#define UART_WR_S3_TXFF(base, value) (UART_RMW_S3(base, UART_S3_TXFF_MASK, UART_S3_TXFF(value)))
#define UART_BWR_S3_TXFF(base, value) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_TXFF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_S3, field PSF[1] (RW)
 *
 * Indicates start of the preamble while the packet is being transmitted. This
 * flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - Preamble start is not detected.
 * - 0b1 - Preamble start is detected.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_PSF field. */
#define UART_RD_S3_PSF(base) ((UART_S3_REG(base) & UART_S3_PSF_MASK) >> UART_S3_PSF_SHIFT)
#define UART_BRD_S3_PSF(base) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PSF_SHIFT))

/*! @brief Set the PSF field to a new value. */
#define UART_WR_S3_PSF(base, value) (UART_RMW_S3(base, UART_S3_PSF_MASK, UART_S3_PSF(value)))
#define UART_BWR_S3_PSF(base, value) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PSF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_S3, field PCTEF[2] (RW)
 *
 * Indicates that packet cycle time period has expired with no activity on the
 * line. This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - Packet cycle time has not expired.
 * - 0b1 - Packet cycle time has expired.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_PCTEF field. */
#define UART_RD_S3_PCTEF(base) ((UART_S3_REG(base) & UART_S3_PCTEF_MASK) >> UART_S3_PCTEF_SHIFT)
#define UART_BRD_S3_PCTEF(base) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PCTEF_SHIFT))

/*! @brief Set the PCTEF field to a new value. */
#define UART_WR_S3_PCTEF(base, value) (UART_RMW_S3(base, UART_S3_PCTEF_MASK, UART_S3_PCTEF(value)))
#define UART_BWR_S3_PCTEF(base, value) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PCTEF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_S3, field PTXF[3] (RW)
 *
 * Indicates that complete packet is transmitted. This flag is cleared by
 * writing 1. In case TX packet gets aborted due to FIFO becoming empty or an overflow,
 * packet transmitted flag will still be generated.
 *
 * Values:
 * - 0b0 - Packet transmission is not complete.
 * - 0b1 - Packet transmission is complete.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_PTXF field. */
#define UART_RD_S3_PTXF(base) ((UART_S3_REG(base) & UART_S3_PTXF_MASK) >> UART_S3_PTXF_SHIFT)
#define UART_BRD_S3_PTXF(base) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PTXF_SHIFT))

/*! @brief Set the PTXF field to a new value. */
#define UART_WR_S3_PTXF(base, value) (UART_RMW_S3(base, UART_S3_PTXF_MASK, UART_S3_PTXF(value)))
#define UART_BWR_S3_PTXF(base, value) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PTXF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_S3, field PRXF[4] (RW)
 *
 * Indicates that complete packet is received. This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - Packet is not received.
 * - 0b1 - Packet is received.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_PRXF field. */
#define UART_RD_S3_PRXF(base) ((UART_S3_REG(base) & UART_S3_PRXF_MASK) >> UART_S3_PRXF_SHIFT)
#define UART_BRD_S3_PRXF(base) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PRXF_SHIFT))

/*! @brief Set the PRXF field to a new value. */
#define UART_WR_S3_PRXF(base, value) (UART_RMW_S3(base, UART_S3_PRXF_MASK, UART_S3_PRXF(value)))
#define UART_BWR_S3_PRXF(base, value) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PRXF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_S3, field ISD[5] (RO)
 *
 * Indicates that initially, a valid one and a line code violation is detected.
 * This flag is cleared by deasserting EN709 bit.
 *
 * Values:
 * - 0b0 - Initial sync is not detected.
 * - 0b1 - Initial sync is detected.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_ISD field. */
#define UART_RD_S3_ISD(base) ((UART_S3_REG(base) & UART_S3_ISD_MASK) >> UART_S3_ISD_SHIFT)
#define UART_BRD_S3_ISD(base) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_ISD_SHIFT))
/*@}*/

/*!
 * @name Register UART_S3, field WBEF[6] (RW)
 *
 * Indicates that the Wbase time period has expired after beta1 time slots. This
 * flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - WBASE time period has not expired.
 * - 0b1 - WBASE time period has expired after beta1 time slots.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_WBEF field. */
#define UART_RD_S3_WBEF(base) ((UART_S3_REG(base) & UART_S3_WBEF_MASK) >> UART_S3_WBEF_SHIFT)
#define UART_BRD_S3_WBEF(base) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_WBEF_SHIFT))

