RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10_extension.h
/*******************************************************************************
 * USBDCD_TIMER1 - TIMER1 register
 ******************************************************************************/

/*!
 * @brief USBDCD_TIMER1 - TIMER1 register (RW)
 *
 * Reset value: 0x000A0028U
 *
 * TIMER1 contains timing parameters. Note that register values can be written
 * that are not compliant with the USB Battery Charging Specification v1.1, so
 * care should be taken when overwriting the default values.
 */
/*!
 * @name Constants and macros for entire USBDCD_TIMER1 register
 */
/*@{*/
#define USBDCD_RD_TIMER1(base)   (USBDCD_TIMER1_REG(base))
#define USBDCD_WR_TIMER1(base, value) (USBDCD_TIMER1_REG(base) = (value))
#define USBDCD_RMW_TIMER1(base, mask, value) (USBDCD_WR_TIMER1(base, (USBDCD_RD_TIMER1(base) & ~(mask)) | (value)))
#define USBDCD_SET_TIMER1(base, value) (USBDCD_WR_TIMER1(base, USBDCD_RD_TIMER1(base) |  (value)))
#define USBDCD_CLR_TIMER1(base, value) (USBDCD_WR_TIMER1(base, USBDCD_RD_TIMER1(base) & ~(value)))
#define USBDCD_TOG_TIMER1(base, value) (USBDCD_WR_TIMER1(base, USBDCD_RD_TIMER1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER1 bitfields
 */

/*!
 * @name Register USBDCD_TIMER1, field TVDPSRC_ON[9:0] (RW)
 *
 * This timing parameter is used after detection of the data pin. See "Charging
 * Port Detection". Valid values are 1-1023, but the USB Battery Charging
 * Specification requires a minimum value of 40 ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER1_TVDPSRC_ON field. */
#define USBDCD_RD_TIMER1_TVDPSRC_ON(base) ((USBDCD_TIMER1_REG(base) & USBDCD_TIMER1_TVDPSRC_ON_MASK) >> USBDCD_TIMER1_TVDPSRC_ON_SHIFT)
#define USBDCD_BRD_TIMER1_TVDPSRC_ON(base) (USBDCD_RD_TIMER1_TVDPSRC_ON(base))

/*! @brief Set the TVDPSRC_ON field to a new value. */
#define USBDCD_WR_TIMER1_TVDPSRC_ON(base, value) (USBDCD_RMW_TIMER1(base, USBDCD_TIMER1_TVDPSRC_ON_MASK, USBDCD_TIMER1_TVDPSRC_ON(value)))
#define USBDCD_BWR_TIMER1_TVDPSRC_ON(base, value) (USBDCD_WR_TIMER1_TVDPSRC_ON(base, value))
/*@}*/

/*!
 * @name Register USBDCD_TIMER1, field TDCD_DBNC[25:16] (RW)
 *
 * Sets the time period (ms) to debounce the D+ signal during the data pin
 * contact detection phase. See "Debouncing the data pin contact" Valid values are
 * 1-1023, but the USB Battery Charging Specification requires a minimum value of 10
 * ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER1_TDCD_DBNC field. */
#define USBDCD_RD_TIMER1_TDCD_DBNC(base) ((USBDCD_TIMER1_REG(base) & USBDCD_TIMER1_TDCD_DBNC_MASK) >> USBDCD_TIMER1_TDCD_DBNC_SHIFT)
#define USBDCD_BRD_TIMER1_TDCD_DBNC(base) (USBDCD_RD_TIMER1_TDCD_DBNC(base))

/*! @brief Set the TDCD_DBNC field to a new value. */
#define USBDCD_WR_TIMER1_TDCD_DBNC(base, value) (USBDCD_RMW_TIMER1(base, USBDCD_TIMER1_TDCD_DBNC_MASK, USBDCD_TIMER1_TDCD_DBNC(value)))
#define USBDCD_BWR_TIMER1_TDCD_DBNC(base, value) (USBDCD_WR_TIMER1_TDCD_DBNC(base, value))
/*@}*/

/*******************************************************************************
 * USBDCD_TIMER2 - TIMER2 register
 ******************************************************************************/

/*!
 * @brief USBDCD_TIMER2 - TIMER2 register (RW)
 *
 * Reset value: 0x00280001U
 *
 * TIMER2 contains timing parameters. Register values can be written that are
 * not compliant with the USB Battery Charging Specification v1.1, so care should
 * be taken when overwriting the default values.
 */
/*!
 * @name Constants and macros for entire USBDCD_TIMER2 register
 */
/*@{*/
#define USBDCD_RD_TIMER2(base)   (USBDCD_TIMER2_REG(base))
#define USBDCD_WR_TIMER2(base, value) (USBDCD_TIMER2_REG(base) = (value))
#define USBDCD_RMW_TIMER2(base, mask, value) (USBDCD_WR_TIMER2(base, (USBDCD_RD_TIMER2(base) & ~(mask)) | (value)))
#define USBDCD_SET_TIMER2(base, value) (USBDCD_WR_TIMER2(base, USBDCD_RD_TIMER2(base) |  (value)))
#define USBDCD_CLR_TIMER2(base, value) (USBDCD_WR_TIMER2(base, USBDCD_RD_TIMER2(base) & ~(value)))
#define USBDCD_TOG_TIMER2(base, value) (USBDCD_WR_TIMER2(base, USBDCD_RD_TIMER2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER2 bitfields
 */

/*!
 * @name Register USBDCD_TIMER2, field CHECK_DM[3:0] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after the device
 * connects to the USB bus until checking the state of the D- line to determine the
 * type of charging port. See "Charger Type Detection." Valid values are 1-15ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_CHECK_DM field. */
#define USBDCD_RD_TIMER2_CHECK_DM(base) ((USBDCD_TIMER2_REG(base) & USBDCD_TIMER2_CHECK_DM_MASK) >> USBDCD_TIMER2_CHECK_DM_SHIFT)
#define USBDCD_BRD_TIMER2_CHECK_DM(base) (USBDCD_RD_TIMER2_CHECK_DM(base))

/*! @brief Set the CHECK_DM field to a new value. */
#define USBDCD_WR_TIMER2_CHECK_DM(base, value) (USBDCD_RMW_TIMER2(base, USBDCD_TIMER2_CHECK_DM_MASK, USBDCD_TIMER2_CHECK_DM(value)))
#define USBDCD_BWR_TIMER2_CHECK_DM(base, value) (USBDCD_WR_TIMER2_CHECK_DM(base, value))
/*@}*/

/*!
 * @name Register USBDCD_TIMER2, field TVDPSRC_CON[25:16] (RW)
 *
 * Sets the time period (ms) that the module waits after charging port detection
 * before system software must enable the D+ pullup to connect to the USB host.
 * Valid values are 1-1023, but the USB Battery Charging Specification requires a
 * minimum value of 40 ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_TVDPSRC_CON field. */
#define USBDCD_RD_TIMER2_TVDPSRC_CON(base) ((USBDCD_TIMER2_REG(base) & USBDCD_TIMER2_TVDPSRC_CON_MASK) >> USBDCD_TIMER2_TVDPSRC_CON_SHIFT)
#define USBDCD_BRD_TIMER2_TVDPSRC_CON(base) (USBDCD_RD_TIMER2_TVDPSRC_CON(base))

/*! @brief Set the TVDPSRC_CON field to a new value. */
#define USBDCD_WR_TIMER2_TVDPSRC_CON(base, value) (USBDCD_RMW_TIMER2(base, USBDCD_TIMER2_TVDPSRC_CON_MASK, USBDCD_TIMER2_TVDPSRC_CON(value)))
#define USBDCD_BWR_TIMER2_TVDPSRC_CON(base, value) (USBDCD_WR_TIMER2_TVDPSRC_CON(base, value))
/*@}*/

/*
 * MK53D10 VREF
 *
 * Voltage Reference
 *
 * Registers defined in this header file:
 * - VREF_TRM - VREF Trim Register
 * - VREF_SC - VREF Status and Control Register
 */

#define VREF_INSTANCE_COUNT (1U) /*!< Number of instances of the VREF module. */
#define VREF_IDX (0U) /*!< Instance number for VREF. */

